[
  {
    "code": "ELEC 221",
    "title": "Electric Circuits",
    "units": "4.25",
    "description": "This course introduces the circuit analysis techniques which are used in subsequent courses in electronics, power, and signals and systems. Circuits containing resistance, capacitance, inductance, and independent and dependent voltage and current sources will be studied. Emphasis is placed on DC, AC, and transient analysis techniques.",
    "hourly_breakdown": "(Lec: 3, Lab: 0.75, Tut: 0.5)",
    "prerequisites": "APSC 112 or APSC 114, APSC 171, APSC 172, APSC 174 \nCorequisites: ELEC 231 or MTHE 235 or MTHE 237 or MTHE 225 or MTHE 232 Exclusions:",
    "offering_term": "Offering Term: F",
    "CEAB": "CEAB Units:\nMathematics 0\nNatural Sciences 0\nComplementary Studies 0\nEngineering Science 38\nEngineering Design 13",
    "offering_faculty": "Smith Engineering",
    "clo": "1. Understand the basic circuit components and the fundamental laws of circuit theories (KCL, KVL, Ohm's law,...).\n2. Derive the mathematical model of resistive, and first and second order circuits.\n3. Solve resistive circuits using techniques such as current voltage divider, mesh-current, node-voltage, Thevenin and Norton, superposition...).\n4. Solve the initial condition and step responses of RC, RL and RLC circuits.\n5. Solve sinusoidal steady-state response of RL, RC, and RLC circuits using techniques such as mesh-current, node-voltage, Thevenin and Norton, superposition.\n6. Calculate power consumption in RL, RC and RLC circuits under steady-state sinusoidal excitation.\n7. Investigate the initial and step response of RL, RC and RLC circuit.\n8. Investigate the sinusoidal steady-state response of RL, RC and RLC circuits and power consummation is such circuits.",
    "num_reviews": 0,
    "num_rating": null,
    "professor": null,
    "difficulty": null,
    "usefulness": null,
    "workload": null
  },
  {
    "code": "ELEC 224",
    "title": "Continuous-Time Signals and Systems",
    "units": "3.75",
    "description": "This is a first course on the basic concepts and applications of signals and systems analysis. Continuous time signals and systems are emphasized. Topics include: representations of continuous-time signals; linear time invariant systems; convolution, impulse response, step response; review of Laplace transforms with applications to circuit and system analysis; transfer function; frequency response and Bode plots; filtering concepts; Fourier series and Fourier transforms; signal spectra; AM modulation and demodulation; introduction to angle modulation.",
    "hourly_breakdown": "(Lec: 3, Lab: 0.25, Tut: 0.5)",
    "prerequisites": "ELEC 221, ELEC 231 or MTHE 225 or MTHE 235 or MTHE 237 \nCorequisites: Exclusions:",
    "offering_term": "Offering Term: W",
    "CEAB": "CEAB Units:\nMathematics 12\nNatural Sciences 0\nComplementary Studies 0\nEngineering Science 33\nEngineering Design 0",
    "offering_faculty": "Smith Engineering",
    "clo": "1. Classify systems based on their properties: in particular, to understand and exploit the implications of linearity, time-invariance, causality, memory, and bounded-input, bounded-out (BIBO) stability.\n2. Understand the concepts of convolution, impulse response and transfer function and how they apply to continuous-time linear time-invariant systems.\n3. Determine Fourier transforms for continuous-time, and understand how to interpret and plot Fourier transform magnitude and phase functions.\n4. Use Laplace transform and its inverse to solve differential equations and to determine the response of linear time-invariant systems to known inputs.\n5. Derive the Fourier Transform and use it as a tool for frequency-domain analysis.\n6. Simulate signals and systems using modern computer software packages.\n7. Use linear systems tools, especially transform analysis and convolution, to analyze and predict the behavior of linear systems.",
    "num_reviews": 0,
    "num_rating": null,
    "professor": null,
    "difficulty": null,
    "usefulness": null,
    "workload": null
 },
 {
    "code": "ELEC 231",
    "title": "Mathematical Methods I for Electrical and Computer Engineering",
    "units": "3.50",
    "description": "Course topics will be presented for problems and applications relevant to electrical and computer engineering; complex numbers, first/second-order ordinary differential equations, analytical methods for solving differential equations including the Laplace transform, convolution, linear systems of differential equations, numerical methods for solving differential equations, and mathematical models for physical/natural phenomena.",
    "hourly_breakdown": "(Lec: 3, Lab: 0, Tut: 0.5)",
    "prerequisites": "Prerequisites: APSC 171, APSC 172, APSC 174 \nCorequisites: Exclusions: MTHE 225, MATH 231, MTHE 235, MTHE 237, MECH 202",
    "offering_term": "Offering Term: F",
    "CEAB": "CEAB Units:\nMathematics 21\nNatural Sciences 11\nComplementary Studies 0\nEngineering Science 10\nEngineering Design 0",
    "offering_faculty": "Smith Engineering",
    "clo": "1. Compute the general or particular solutions to linear and nonlinear differential equations, and systems of differential equations to model practical applications in electrical and computer engineering.\n2. Understand the implications of the existence and uniqueness theorem and linear independence/dependence properties of solutions to differential equations.\n 3. Develop mathematical models describing physical/natural phenomena, with emphasis on problem based learning using authentic real-world electrical and computer engineering applications.\n4. Use the method of Laplace transform to solve differential equations with applications in communication, signal processing, control systems.\n5. Model a RLC (resistor, inductor, capacitor) circuit using ordinary differential equations.\n6. Numerically solve differential equations to provide tractable solutions for complex engineering systems.",
    "num_reviews": 0,
    "num_rating": null,
    "professor": null,
    "difficulty": null,
    "usefulness": null,
    "workload": null
 },
 {
    "code": "ELEC 232",
    "title": "Mathematical Methods I for Electrical and Computer Engineering",
    "units": "3.50",
    "description": "Course topics will be presented for problems and applications relevant to electrical engineering; vector calculus with line/surface/volume integrals, divergence, curl, Green's and Stokes' theorems; complex analysis with Cauchy-Reimann equations, transcendental functions, contour integration, Cauchy's theorem and integral formula, Taylor and Laurent series, and the residue theorem.",
    "hourly_breakdown": "(Lec: 3, Lab: 0, Tut: 0.5)",
    "prerequisites": "APSC 171, APSC 172, APSC 174 \nCorequisites: Exclusions:",
    "offering_term": "Offering Term: W",
    "CEAB": "CEAB Units:\nMathematics 42\nNatural Sciences 0\nComplementary Studies 0\nEngineering Science 0\nEngineering Design 0",
    "offering_faculty": "Smith Engineering",
    "clo": "1. Understand vector calculus fundamentals and computing line/surface/volume integrals for different applications in the context of electrical engineering.\n2. Understand concepts and applications of divergence, curl, Green’s and Stokes’ Theorems on real-world electrical engineering scenarios in practical settings.\n3. Evaluate contour integrals using residue theory in electrical engineering applications.\n4. Compute harmonic conjugates of harmonic functions in electrical circuits, signal processing and controls.\n5. Solve algebraic equations involving complex numbers in electrical engineering.\n6. Compute Taylor and Laurent expansions of complex analytic functions typical in electrical engineering problems (e.g. small-signal approximations for transistor models BJTs or MOSFETs).",
    "num_reviews": 0,
    "num_rating": null,
    "professor": null,
    "difficulty": null,
    "usefulness": null,
    "workload": null
 },
 {
    "code": "ELEC 252",
    "title": "Electronics I",
    "units": "4.25",
    "description": "This course is an introduction to semiconductor electronics for students in the Electrical Engineering program and related programs. Topics studied include: operational amplifiers; dc and small signal models for diodes, basic principles of bipolar transistors and field effect transistors, dc analysis of electronic circuits and practical applications of the devices to the design of power supplies, amplifiers and digital logic circuits.",
    "hourly_breakdown": "(Lec: 3, Lab: 0.75, Tut: 0.5)",
    "prerequisites": "Prerequisites: ELEC 221 Corequisites: Exclusions:",
    "offering_term": "Offering Term: W",
    "CEAB": "CEAB Units:\nMathematics 0\nNatural Sciences 0\nComplementary Studies 0\nEngineering Science 36\nEngineering Design 15",
    "offering_faculty": "Smith Engineering",
    "clo": "1. Describe semiconductor behaviour and terminal characteristics of junction diodes and transistors.\n2. Construct linearized models of nonlinear semiconductor devices, including diodes and transistors, and apply them to analysis of circuits.\n3. Conduct large signal analysis of circuits using operational amplifiers, diodes and transistors.\n4. Design circuits for practical applications including power conversion, and digital and analog signal.\n5. Use computer-aided design tools to analyze and optimize practical electronic circuits.\n6. Implement and characterize electronic circuits using fundamental test equipment.",
    "num_reviews": 0,
    "num_rating": null,
    "professor": null,
    "difficulty": null,
    "usefulness": null,
    "workload": null
 },
 {
    "code": "ELEC 270",
    "title": "Discrete Mathematics with Computer Engineering App",
    "units": "3.50",
    "description": "Introduction to the mathematics of representing and manipulating discrete objects. Topics include numbers, modular arithmetic, counting, relations and graph theory. Methods of proof and reasoning - such as induction and mathematical logic - will also be covered. Some applications to cryptosystems, hashing functions, and job scheduling will be included.",
    "hourly_breakdown": "(Lec: 3, Lab: 0, Tut: 0.5)",
    "prerequisites": "Prerequisites: APSC 142 or APSC 143 or MNTC 313 \nCorequisites: Exclusions:",
    "offering_term": "Offering Term: W",
    "CEAB": "CEAB Units:\nMathematics 31\nNatural Sciences 0\nComplementary Studies 0\nEngineering Science 11\nEngineering Design 0",
    "offering_faculty": "Smith Engineering",
    "clo": "1. Identify when a mathematical proposition is a tautology, contradiction, or logical equivalence.\n2. Determine whether a relation is an equivalence relation or whether a relation is a partial order.\n3. Use mathematical induction as a proof technique to prove a result.\n4. Apply the Pigeonhole Principle in mathematical proofs.\n5. Be able to compute an inverse in modular arithmetic and know how to use it to solve linear congruences.\n6. Apply counting techniques such as inclusion-exclusion, combinations and permutations to count large groups of objects.",
    "num_reviews": 0,
    "num_rating": null,
    "professor": null,
    "difficulty": null,
    "usefulness": null,
    "workload": null
 },
 {
    "code": "ELEC 271",
    "title": "Digital Systems",
    "units": "4.00",
    "description": "Boolean algebra applied to digital systems; logic gates; combinational logic design; electronic circuits for logic gates; arithmetic circuits; latches and flipflops, registers and counters; synchronous sequential logic and state machine design; implementation in programmable logic chips.",
    "hourly_breakdown": "(Lec: 3, Lab: 0.5, Tut: 0.5)",
    "prerequisites": "Prerequisites: APSC 171, APSC 172, APSC 174 \nCorequisites: Exclusions:",
    "offering_term": "Offering Term: F",
    "CEAB": "CEAB Units:\nMathematics 0\nNatural Sciences 0\nComplementary Studies 0\nEngineering Science 21\nEngineering Design 27",
    "offering_faculty": "Smith Engineering",
    "clo": "1. Represent combinational logic building blocks such as multiplexers, encoders, and decoders in algebraic form, in schematic form, and in the syntax of a hardware design language for computer-aided logic synthesis.\n2. Represent latches and flip-flops for storing information in schematic form and in hardware-design-language syntax and describe the timing behavior of flip-flops.\n3. Optimize a combinational logic function with Karnaugh maps, both with and without don’t-care valuations.\n4. Design a finite-state machine from a given state diagram by directly deriving and optimizing the next-state and output logic, and by generating a behavioural description in a hardware design language for computer- aided logic synthesis.",
    "num_reviews": 0,
    "num_rating": null,
    "professor": null,
    "difficulty": null,
    "usefulness": null,
    "workload": null
 },
 {
    "code": "ELEC 274",
    "title": "Computer Architecture",
    "units": "4.00",
    "description": "Number and data representation. Logical structure of computers. Instruction set architecture. Instruction execution sequencing. Assembly-language programming including subroutines and parameter passing. Input/output interfaces and programming. Processor datapath and control unit design. Semiconductor memory technology and memory hierarchy design.",
    "hourly_breakdown": "(Lec: 3, Lab: 0.5, Tut: 0.5)",
    "prerequisites": "Prerequisites: APSC 142 or APSC 143 or MNTC 313, ELEC 271 or MTHE 217 \nCorequisites: Exclusions: CISC 221",
    "offering_term": "Offering Term: W",
    "CEAB": "CEAB Units:\nMathematics 0\nNatural Sciences 0\nComplementary Studies 0\nEngineering Science 26\nEngineering Design 22",
    "offering_faculty": "Smith Engineering",
    "clo": "1. Understand instruction set architecture to support arithmetic, memory-access, and program branching operations.\n2. Understand internal semiconductor memory architecture and the design of basic cache and memory organizations.\n3. Use register-transfer notation to specify cycle-by-cycle logic behavior of instruction execution in a basic five-stage processing unit.\n4. Write a subroutine-based assembly-language program for specified data processing and input/output operations.",
    "num_reviews": 0,
    "num_rating": null,
    "professor": null,
    "difficulty": null,
    "usefulness": null,
    "workload": null
 },
 {
    "code": "ELEC 278",
    "title": "Fundamentals Of Information Structures",
    "units": "4.00",
    "description": "Software organization with subroutines and parameter passing. Data structures including arrays, linked lists, stacks, queues, deques, hash and scatter tables, trees and search trees, heaps and priority queues, and graphs. Recursion. Algorithm analysis and asymptotic notation. Sorting algorithms. Advanced programming in the C language.",
    "hourly_breakdown": "(Lec: 3, Lab: 0.5, Tut: 0.5)",
    "prerequisites": "Prerequisites: APSC 142 or APSC 143 or MNTC 313 \nCorequisites: Exclusions: CISC 235, MREN 178",
    "offering_term": "Offering Term: F",
    "CEAB": "CEAB Units:\nMathematics 12\nNatural Sciences 0\nComplementary Studies 0\nEngineering Science 24\nEngineering Design 12",
    "offering_faculty": "Smith Engineering",
    "clo": "1. Identify and describe the standard data structures and algorithms.\n2. Describe fundamental techniques for comparing alternative data structures and algorithms.\n3. Implement fundamental data structures using the C programming language.\n4. Select the appropriate data structure or algorithm to efficiently solve a given computing problem.\n5. Analyze a given computing problem and solve it using suitable data structures and algorithms.\n6. Examine solutions using critical thinking to increase efficiency and robustness of a given computing problem solution.",
    "num_reviews": 0,
    "num_rating": null,
    "professor": null,
    "difficulty": null,
    "usefulness": null,
    "workload": null
 },
 {
    "code": "ELEC 279",
    "title": "Introduction to Object Oriented Programming",
    "units": "4.00",
    "description": "Introduction to object-oriented design, architecture, and programming. Use of packages, class libraries, and interfaces. Encapsulation and representational abstraction. Inheritance. Polymorphic programming. Exception handling. Iterators. Introduction to a class design notation. Applications in various areas.",
    "hourly_breakdown": "(Lec: 3, Lab: 1, Tut: 0)",
    "prerequisites": "Prerequisites: APSC 142 or APSC 143 or MNTC 313, ELEC 278 or MREN 178 \nCorequisites: Exclusions: CISC 124, CMPE 212",
    "offering_term": "Offering Term: W",
    "CEAB": "CEAB Units:\nMathematics 0\nNatural Sciences 0\nComplementary Studies 0\nEngineering Science 26\nEngineering Design 22",
    "offering_faculty": "Smith Engineering",
    "clo": "1. Demonstrate understanding of fundamental concepts of object-oriented programming.\n2. Design and implement object-oriented programs.\n3. Debug and test object-oriented programs.\n4. Develop basic programming skills in Java.\n5. Implement programs with graphical user interface.",
    "num_reviews": 0,
    "num_rating": null,
    "professor": null,
    "difficulty": null,
    "usefulness": null,
    "workload": null
 },
 {
    "code": "ELEC 280",
    "title": "Fundamentals of Electromagnetics",
    "units": "3.75",
    "description": "A study of the fundamental aspects of electromagnetic fields. The following topics are covered: the Maxwell's equations and the 3-dimensional wave equation for transmission lines; vector analysis, including orthogonal coordinate systems, and the calculus of field quantities; electrostatic fields including the concepts of electric potential, capacitance, and current and current density; magnetostatic fields including inductance; time-varying fields and the complete form of Maxwell's equations; basic transmission line phenomena including steady-state sinusoidal behaviour and standing waves, transient performance and impedance matching.",
    "hourly_breakdown": "(Lec: 3, Lab: 0.25, Tut: 0.5)",
    "prerequisites": "APSC 112 or APSC 114, APSC 171, APSC 172, APSC 174 \nCorequisites: Exclusions:",
    "offering_term": "Offering Term: W",
    "CEAB": "CEAB Units:\nMathematics 0\nNatural Sciences 27\nComplementary Studies 0\nEngineering Science 18\nEngineering Design 0",
    "offering_faculty": "Smith Engineering",
    "clo": "1. Determine electrostatic fields using Coulomb's law and Gauss's law.\n2. Determine magnetostatic fields using Biot-Savart's law and Ampere's law.\n3. Calculate voltage or current across transverse electromagnetic (TEM) transmission lines.\n4. Calculate the induced voltage in time-varying electromagnetic fields using Maxwell's equations.\n5. Analyze the transmission line parameters using various techniques including Smith chart, and calculate transient voltage and current of the transmission line.\n6. Calculate the gradient, divergence, and curl of various scalar and vector fields.\n7. Calculate the gradient, divergence, and curl of various scalar and vector fields.",
    "num_reviews": 0,
    "num_rating": null,
    "professor": null,
    "difficulty": null,
    "usefulness": null,
    "workload": null
 },
 {
    "code": "ELEC 290",
    "title": "Electrical and Computer Engineering Design and Practice",
    "units": "5.00",
    "description": "This course encompasses team-based design to solve complex open-ended problems. Instruction is provided on problem definition, creation of ideas, and decision making that considers technical, economic, societal, and environmental factors. Attention is given to safety considerations, technical codes and regulations, and engineering ethics. Effective skills for oral and written communication are also emphasized. These aspects are applied in design project activity related to electrical and computer engineering.",
    "hourly_breakdown": "(Lec: Yes, Lab: Yes, Tut: Yes)",
    "prerequisites": "APSC 100 or APSC 103; APSC 199 \nCorequisites: Exclusions: APSC 200, APSC 293, APSC 202, APSC 210, MREN 203",
    "offering_term": "Offering Term: F",
    "CEAB": "CEAB Units:\nMathematics 0\nNatural Sciences 0\nComplementary Studies 18\nEngineering Science 0\nEngineering Design 42",
    "offering_faculty": "Smith Engineering",
    "clo": "1. Develop and apply excellent written communication skills.\n2. Develop and apply excellent verbal communication skills.\n3. Develop and apply excellent presentation skills.\n4. Use graphics and figures to effectively support written and verbal communication.\n5. Reflect on project activities and provide insight related to project and learning scenarios.\n6. Apply information research, assessment, and management concepts in engineering design.\n7. Design creative solution(s) for open-ended, complex problems, applying engineering principles and theories from courses in other disciplines where applicable.\n8. Apply design processes and tools for problem definition, idea generation, and decision making.\n9. Make design decisions using financial factors, environmental factors, social factors, and public interests.\n10. Consider equity, diversity, inclusion, and indigenization during the design process.\n11. Incorporate the core principles of project management into the development of design solutions (including frameworks, objectives, scheduling, work breakdown, milestones, and life cycle).\n12. Discuss engineering as a regulated profession, including reference to relevant engineering regulations/codes/standards, ethics, equity, health and safety.\n13. Discuss professional/technical associations in engineering and discipline.\n14. Discuss the role of ethics in a project with reference to real-world engineering applications.\n15. Demonstrate effective teaming skills.\n16. Demonstrate ability to identify and to address personal educational needs.",
    "num_reviews": 0,
    "num_rating": null,
    "professor": null,
    "difficulty": null,
    "usefulness": null,
    "workload": null
 },
 {
    "code": "ELEC 292",
    "title": "Introduction to Data Science",
    "units": "3.00",
    "description": "Fundamentals of data science: data capture, organization and maintenance, processing, and visualization. Implementation of data processing methods using Python. Application of the methods to design and implement a solution to a project-based data science problem.",
    "hourly_breakdown": "(Lec: Yes, Lab: Yes, Tut: No)",
    "prerequisites": "ELEC 278 or MREN 178 \nCorequisites: Exclusions:",
    "offering_term": "Offering Term: W",
    "CEAB": "CEAB Units:\nMathematics 0\nNatural Sciences 0\nComplementary Studies 0\nEngineering Science 18\nEngineering Design 18",
    "offering_faculty": "Smith Engineering",
    "clo": "CLOs coming soon; please refer to your course syllabus in the meantime.",
    "num_reviews": 0,
    "num_rating": null,
    "professor": null,
    "difficulty": null,
    "usefulness": null,
    "workload": null
 }
]