[
  {
    "code": "ELEC 221",
    "title": "Electric Circuits",
    "units": "4.25",
    "description": "This course introduces the circuit analysis techniques which are used in subsequent courses in electronics, power, and signals and systems. Circuits containing resistance, capacitance, inductance, and independent and dependent voltage and current sources will be studied. Emphasis is placed on DC, AC, and transient analysis techniques.",
    "hourly_breakdown": "Lec: 3, Lab: 0.75, Tut: 0.5",
    "prerequisites": "APSC 112 or APSC 114, APSC 171, APSC 172, APSC 174",
    "corequisites": "ELEC 231 or MTHE 235 or MTHE 237 or MTHE 225 or MTHE 232",
    "offering_term": "Fall (F)",
    "CEAB": "Mathematics: 0 \nNatural Sciences: 0\nComplementary Studies: 0\nEngineering Science: 38\nEngineering Design: 13",
    "offering_faculty": "Smith Engineering",
    "clo": "1. Understand the basic circuit components and the fundamental laws of circuit theories (KCL, KVL, Ohm's law,...).\n2. Derive the mathematical model of resistive, and first and second order circuits.\n3. Solve resistive circuits using techniques such as current voltage divider, mesh-current, node-voltage, Thevenin and Norton, superposition...).\n4. Solve the initial condition and step responses of RC, RL and RLC circuits.\n5. Solve sinusoidal steady-state response of RL, RC, and RLC circuits using techniques such as mesh-current, node-voltage, Thevenin and Norton, superposition.\n6. Calculate power consumption in RL, RC and RLC circuits under steady-state sinusoidal excitation.\n7. Investigate the initial and step response of RL, RC and RLC circuit.\n8. Investigate the sinusoidal steady-state response of RL, RC and RLC circuits and power consummation is such circuits.",
    "num_reviews": 0,
    "num_rating": null,
    "professor": null,
    "difficulty": null,
    "usefulness": null,
    "workload": null
  },
  {
    "code": "ELEC 224",
    "title": "Continuous-Time Signals and Systems",
    "units": "3.75",
    "description": "This is a first course on the basic concepts and applications of signals and systems analysis. Continuous time signals and systems are emphasized. Topics include: representations of continuous-time signals; linear time invariant systems; convolution, impulse response, step response; review of Laplace transforms with applications to circuit and system analysis; transfer function; frequency response and Bode plots; filtering concepts; Fourier series and Fourier transforms; signal spectra; AM modulation and demodulation; introduction to angle modulation.",
    "hourly_breakdown": "Lec: 3, Lab: 0.25, Tut: 0.5",
    "prerequisites": "ELEC 221, ELEC 231 or MTHE 225 or MTHE 235 or MTHE 237",
    "corequisites": "N/A",
    "offering_term": "Winter (W)",
    "CEAB": "Mathematics: 12 \nNatural Sciences: 0\nComplementary Studies: 0\nEngineering Science: 33\nEngineering Design: 0",
    "offering_faculty": "Smith Engineering",
    "clo": "1. Classify systems based on their properties: in particular, to understand and exploit the implications of linearity, time-invariance, causality, memory, and bounded-input, bounded-out (BIBO) stability.\n2. Understand the concepts of convolution, impulse response and transfer function and how they apply to continuous-time linear time-invariant systems.\n3. Determine Fourier transforms for continuous-time, and understand how to interpret and plot Fourier transform magnitude and phase functions.\n4. Use Laplace transform and its inverse to solve differential equations and to determine the response of linear time-invariant systems to known inputs.\n5. Derive the Fourier Transform and use it as a tool for frequency-domain analysis.\n6. Simulate signals and systems using modern computer software packages.\n7. Use linear systems tools, especially transform analysis and convolution, to analyze and predict the behavior of linear systems.",
    "num_reviews": 0,
    "num_rating": null,
    "professor": null,
    "difficulty": null,
    "usefulness": null,
    "workload": null
 },
 {
    "code": "ELEC 231",
    "title": "Mathematical Methods II for Electrical and Computer Engineering",
    "units": "3.50",
    "description": "Course topics will be presented for problems and applications relevant to electrical and computer engineering; complex numbers, first/second-order ordinary differential equations, analytical methods for solving differential equations including the Laplace transform, convolution, linear systems of differential equations, numerical methods for solving differential equations, and mathematical models for physical/natural phenomena.",
    "hourly_breakdown": "Lec: 3, Lab: 0, Tut: 0.5",
    "prerequisites": "Prerequisites: APSC 171, APSC 172, APSC 174",
    "corequisites": "MTHE 225, MATH 231, MTHE 235, MTHE 237, MECH 202",
    "offering_term": "Winter (W)",
    "CEAB": "Mathematics: 21\nNatural Sciences: 11\nComplementary Studies: 0\nEngineering Science: 10\nEngineering Design: 0",
    "offering_faculty": "Smith Engineering",
    "clo": "1. Compute the general or particular solutions to linear and nonlinear differential equations, and systems of differential equations to model practical applications in electrical and computer engineering.\n2. Understand the implications of the existence and uniqueness theorem and linear independence/dependence properties of solutions to differential equations.\n 3. Develop mathematical models describing physical/natural phenomena, with emphasis on problem based learning using authentic real-world electrical and computer engineering applications.\n4. Use the method of Laplace transform to solve differential equations with applications in communication, signal processing, control systems.\n5. Model a RLC (resistor, inductor, capacitor) circuit using ordinary differential equations.\n6. Numerically solve differential equations to provide tractable solutions for complex engineering systems.",
    "num_reviews": 0,
    "num_rating": null,
    "professor": null,
    "difficulty": null,
    "usefulness": null,
    "workload": null
 },
 {
    "code": "ELEC 232",
    "title": "Mathematical Methods I for Electrical and Computer Engineering",
    "units": "3.50",
    "description": "Course topics will be presented for problems and applications relevant to electrical engineering; vector calculus with line/surface/volume integrals, divergence, curl, Green's and Stokes' theorems; complex analysis with Cauchy-Reimann equations, transcendental functions, contour integration, Cauchy's theorem and integral formula, Taylor and Laurent series, and the residue theorem.",
    "hourly_breakdown": "Lec: 3, Lab: 0, Tut: 0.5",
    "prerequisites": "APSC 171, APSC 172, APSC 174",
    "corequisites": "N/A",
    "offering_term": "Winter (W)",
    "CEAB": "Mathematics: 42\nNatural Sciences: 0\nComplementary Studies: 0\nEngineering Science: 0\nEngineering Design: 0",
    "offering_faculty": "Smith Engineering",
    "clo": "1. Understand vector calculus fundamentals and computing line/surface/volume integrals for different applications in the context of electrical engineering.\n2. Understand concepts and applications of divergence, curl, Green’s and Stokes’ Theorems on real-world electrical engineering scenarios in practical settings.\n3. Evaluate contour integrals using residue theory in electrical engineering applications.\n4. Compute harmonic conjugates of harmonic functions in electrical circuits, signal processing and controls.\n5. Solve algebraic equations involving complex numbers in electrical engineering.\n6. Compute Taylor and Laurent expansions of complex analytic functions typical in electrical engineering problems (e.g. small-signal approximations for transistor models BJTs or MOSFETs).",
    "num_reviews": 0,
    "num_rating": null,
    "professor": null,
    "difficulty": null,
    "usefulness": null,
    "workload": null
 },
 {
    "code": "ELEC 252",
    "title": "Electronics I",
    "units": "4.25",
    "description": "This course is an introduction to semiconductor electronics for students in the Electrical Engineering program and related programs. Topics studied include: operational amplifiers; dc and small signal models for diodes, basic principles of bipolar transistors and field effect transistors, dc analysis of electronic circuits and practical applications of the devices to the design of power supplies, amplifiers and digital logic circuits.",
    "hourly_breakdown": "Lec: 3, Lab: 0.75, Tut: 0.5",
    "prerequisites": "Prerequisites: ELEC 221",
    "corequisites": "N/A",
    "offering_term": "Winter (W)",
    "CEAB": "Mathematics: 0\nNatural Sciences: 0\nComplementary Studies: 0\nEngineering Science: 36\nEngineering Design: 15",
    "offering_faculty": "Smith Engineering",
    "clo": "1. Describe semiconductor behaviour and terminal characteristics of junction diodes and transistors.\n2. Construct linearized models of nonlinear semiconductor devices, including diodes and transistors, and apply them to analysis of circuits.\n3. Conduct large signal analysis of circuits using operational amplifiers, diodes and transistors.\n4. Design circuits for practical applications including power conversion, and digital and analog signal.\n5. Use computer-aided design tools to analyze and optimize practical electronic circuits.\n6. Implement and characterize electronic circuits using fundamental test equipment.",
    "num_reviews": 0,
    "num_rating": null,
    "professor": "Brian Frank",
    "difficulty": null,
    "usefulness": null,
    "workload": null
 },
 {
    "code": "ELEC 270",
    "title": "Discrete Mathematics with Computer Engineering App",
    "units": "3.50",
    "description": "Introduction to the mathematics of representing and manipulating discrete objects. Topics include numbers, modular arithmetic, counting, relations and graph theory. Methods of proof and reasoning - such as induction and mathematical logic - will also be covered. Some applications to cryptosystems, hashing functions, and job scheduling will be included.",
    "hourly_breakdown": "Lec: 3, Lab: 0, Tut: 0.5",
    "prerequisites": "Prerequisites: APSC 142 or APSC 143 or MNTC 313",
    "corequisites": "N/A",
    "offering_term": "Winter (W)",
    "CEAB": "Mathematics: 31\nNatural Sciences: 0\nComplementary Studies: 0\nEngineering Science: 11\nEngineering Design: 0",
    "offering_faculty": "Smith Engineering",
    "clo": "1. Identify when a mathematical proposition is a tautology, contradiction, or logical equivalence.\n2. Determine whether a relation is an equivalence relation or whether a relation is a partial order.\n3. Use mathematical induction as a proof technique to prove a result.\n4. Apply the Pigeonhole Principle in mathematical proofs.\n5. Be able to compute an inverse in modular arithmetic and know how to use it to solve linear congruences.\n6. Apply counting techniques such as inclusion-exclusion, combinations and permutations to count large groups of objects.",
    "num_reviews": 0,
    "num_rating": null,
    "professor": null,
    "difficulty": null,
    "usefulness": null,
    "workload": null
 },
 {
    "code": "ELEC 271",
    "title": "Digital Systems",
    "units": "4.00",
    "description": "Boolean algebra applied to digital systems; logic gates; combinational logic design; electronic circuits for logic gates; arithmetic circuits; latches and flipflops, registers and counters; synchronous sequential logic and state machine design; implementation in programmable logic chips.",
    "hourly_breakdown": "Lec: 3, Lab: 0.5, Tut: 0.5",
    "prerequisites": "Prerequisites: APSC 171, APSC 172, APSC 174",
    "corequisites": "N/A",
    "offering_term": "Fall (F)",
    "CEAB": "Mathematics: 0\nNatural Sciences: 0\nComplementary Studies: 0\nEngineering Science: 21\nEngineering Design: 27",
    "offering_faculty": "Smith Engineering",
    "clo": "1. Represent combinational logic building blocks such as multiplexers, encoders, and decoders in algebraic form, in schematic form, and in the syntax of a hardware design language for computer-aided logic synthesis.\n2. Represent latches and flip-flops for storing information in schematic form and in hardware-design-language syntax and describe the timing behavior of flip-flops.\n3. Optimize a combinational logic function with Karnaugh maps, both with and without don’t-care valuations.\n4. Design a finite-state machine from a given state diagram by directly deriving and optimizing the next-state and output logic, and by generating a behavioural description in a hardware design language for computer- aided logic synthesis.",
    "num_reviews": 0,
    "num_rating": null,
    "professor": "Ryan Grant",
    "difficulty": null,
    "usefulness": null,
    "workload": null
 },
 {
    "code": "ELEC 274",
    "title": "Computer Architecture",
    "units": "4.00",
    "description": "Number and data representation. Logical structure of computers. Instruction set architecture. Instruction execution sequencing. Assembly-language programming including subroutines and parameter passing. Input/output interfaces and programming. Processor datapath and control unit design. Semiconductor memory technology and memory hierarchy design.",
    "hourly_breakdown": "Lec: 3, Lab: 0.5, Tut: 0.5",
    "prerequisites": "Prerequisites: APSC 142 or APSC 143 or MNTC 313, ELEC 271 or MTHE 217",
    "corequisites": "N/A",
    "offering_term": "Winter (W)",
    "CEAB": "Mathematics: 0\nNatural Sciences: 0\nComplementary Studies: 0\nEngineering Science: 26\nEngineering Design: 22",
    "offering_faculty": "Smith Engineering",
    "clo": "1. Understand instruction set architecture to support arithmetic, memory-access, and program branching operations.\n2. Understand internal semiconductor memory architecture and the design of basic cache and memory organizations.\n3. Use register-transfer notation to specify cycle-by-cycle logic behavior of instruction execution in a basic five-stage processing unit.\n4. Write a subroutine-based assembly-language program for specified data processing and input/output operations.",
    "num_reviews": 0,
    "num_rating": null,
    "professor": "Naraig Manjikian",
    "difficulty": null,
    "usefulness": null,
    "workload": null
 },
 {
    "code": "ELEC 278",
    "title": "Fundamentals Of Information Structures",
    "units": "4.00",
    "description": "Software organization with subroutines and parameter passing. Data structures including arrays, linked lists, stacks, queues, deques, hash and scatter tables, trees and search trees, heaps and priority queues, and graphs. Recursion. Algorithm analysis and asymptotic notation. Sorting algorithms. Advanced programming in the C language.",
    "hourly_breakdown": "Lec: 3, Lab: 0.5, Tut: 0.5",
    "prerequisites": "Prerequisites: APSC 142 or APSC 143 or MNTC 313",
    "corequisites": "N/A",
    "offering_term": "Fall (F)",
    "CEAB": "Mathematics: 12\nNatural Sciences: 0\nComplementary Studies: 0\nEngineering Science: 24\nEngineering Design: 12",
    "offering_faculty": "Smith Engineering",
    "clo": "1. Identify and describe the standard data structures and algorithms.\n2. Describe fundamental techniques for comparing alternative data structures and algorithms.\n3. Implement fundamental data structures using the C programming language.\n4. Select the appropriate data structure or algorithm to efficiently solve a given computing problem.\n5. Analyze a given computing problem and solve it using suitable data structures and algorithms.\n6. Examine solutions using critical thinking to increase efficiency and robustness of a given computing problem solution.",
    "num_reviews": 0,
    "num_rating": null,
    "professor": null,
    "difficulty": null,
    "usefulness": null,
    "workload": null
 },
 {
    "code": "ELEC 279",
    "title": "Introduction to Object Oriented Programming",
    "units": "4.00",
    "description": "Introduction to object-oriented design, architecture, and programming. Use of packages, class libraries, and interfaces. Encapsulation and representational abstraction. Inheritance. Polymorphic programming. Exception handling. Iterators. Introduction to a class design notation. Applications in various areas.",
    "hourly_breakdown": "Lec: 3, Lab: 1, Tut: 0",
    "prerequisites": "Prerequisites: APSC 142 or APSC 143 or MNTC 313, ELEC 278 or MREN 178",
    "corequisites": "CISC 124, CMPE 212",
    "offering_term": "Winter (W)",
    "CEAB": "Mathematics: 0\nNatural Sciences: 0\nComplementary Studies: 0\nEngineering Science: 26\nEngineering Design: 22",
    "offering_faculty": "Smith Engineering",
    "clo": "1. Demonstrate understanding of fundamental concepts of object-oriented programming.\n2. Design and implement object-oriented programs.\n3. Debug and test object-oriented programs.\n4. Develop basic programming skills in Java.\n5. Implement programs with graphical user interface.",
    "num_reviews": 0,
    "num_rating": null,
    "professor": null,
    "difficulty": null,
    "usefulness": null,
    "workload": null
 },
 {
    "code": "ELEC 280",
    "title": "Fundamentals of Electromagnetics",
    "units": "3.75",
    "description": "A study of the fundamental aspects of electromagnetic fields. The following topics are covered: the Maxwell's equations and the 3-dimensional wave equation for transmission lines; vector analysis, including orthogonal coordinate systems, and the calculus of field quantities; electrostatic fields including the concepts of electric potential, capacitance, and current and current density; magnetostatic fields including inductance; time-varying fields and the complete form of Maxwell's equations; basic transmission line phenomena including steady-state sinusoidal behaviour and standing waves, transient performance and impedance matching.",
    "hourly_breakdown": "Lec: 3, Lab: 0.25, Tut: 0.5",
    "prerequisites": "APSC 112 or APSC 114, APSC 171, APSC 172, APSC 174",
    "corequisites": "N/A",
    "offering_term": "Winter (W)",
    "CEAB": "Mathematics: 0\nNatural Sciences: 27\nComplementary Studies: 0\nEngineering Science: 18\nEngineering Design: 0",
    "offering_faculty": "Smith Engineering",
    "clo": "1. Determine electrostatic fields using Coulomb's law and Gauss's law.\n2. Determine magnetostatic fields using Biot-Savart's law and Ampere's law.\n3. Calculate voltage or current across transverse electromagnetic (TEM) transmission lines.\n4. Calculate the induced voltage in time-varying electromagnetic fields using Maxwell's equations.\n5. Analyze the transmission line parameters using various techniques including Smith chart, and calculate transient voltage and current of the transmission line.\n6. Calculate the gradient, divergence, and curl of various scalar and vector fields.\n7. Calculate the gradient, divergence, and curl of various scalar and vector fields.",
    "num_reviews": 0,
    "num_rating": null,
    "professor": null,
    "difficulty": null,
    "usefulness": null,
    "workload": null
 },
 {
    "code": "ELEC 290",
    "title": "Electrical and Computer Engineering Design and Practice",
    "units": "5.00",
    "description": "This course encompasses team-based design to solve complex open-ended problems. Instruction is provided on problem definition, creation of ideas, and decision making that considers technical, economic, societal, and environmental factors. Attention is given to safety considerations, technical codes and regulations, and engineering ethics. Effective skills for oral and written communication are also emphasized. These aspects are applied in design project activity related to electrical and computer engineering.",
    "hourly_breakdown": "Lec: Yes, Lab: Yes, Tut: Yes",
    "prerequisites": "APSC 100 or APSC 103; APSC 199",
    "corequisites": "APSC 200, APSC 293, APSC 202, APSC 210, MREN 203",
    "offering_term": "Fall (F)",
    "CEAB": "Mathematics: 0\nNatural Sciences: 0\nComplementary Studies: 18\nEngineering Science: 0\nEngineering Design: 42",
    "offering_faculty": "Smith Engineering",
    "clo": "1. Develop and apply excellent written communication skills.\n2. Develop and apply excellent verbal communication skills.\n3. Develop and apply excellent presentation skills.\n4. Use graphics and figures to effectively support written and verbal communication.\n5. Reflect on project activities and provide insight related to project and learning scenarios.\n6. Apply information research, assessment, and management concepts in engineering design.\n7. Design creative solution(s) for open-ended, complex problems, applying engineering principles and theories from courses in other disciplines where applicable.\n8. Apply design processes and tools for problem definition, idea generation, and decision making.\n9. Make design decisions using financial factors, environmental factors, social factors, and public interests.\n10. Consider equity, diversity, inclusion, and indigenization during the design process.\n11. Incorporate the core principles of project management into the development of design solutions (including frameworks, objectives, scheduling, work breakdown, milestones, and life cycle).\n12. Discuss engineering as a regulated profession, including reference to relevant engineering regulations/codes/standards, ethics, equity, health and safety.\n13. Discuss professional/technical associations in engineering and discipline.\n14. Discuss the role of ethics in a project with reference to real-world engineering applications.\n15. Demonstrate effective teaming skills.\n16. Demonstrate ability to identify and to address personal educational needs.",
    "num_reviews": 0,
    "num_rating": null,
    "professor": null,
    "difficulty": null,
    "usefulness": null,
    "workload": null
 },
 {
    "code": "ELEC 292",
    "title": "Introduction to Data Science",
    "units": "3.00",
    "description": "Fundamentals of data science: data capture, organization and maintenance, processing, and visualization. Implementation of data processing methods using Python. Application of the methods to design and implement a solution to a project-based data science problem.",
    "hourly_breakdown": "Lec: Yes, Lab: Yes, Tut: No",
    "prerequisites": "ELEC 278 or MREN 178",
    "corequisites": "N/A",
    "offering_term": "Winter (W)",
    "CEAB": "Mathematics: 0\nNatural Sciences: 0\nComplementary Studies: 0\nEngineering Science: 18\nEngineering Design: 18",
    "offering_faculty": "Smith Engineering",
    "clo": "CLOs coming soon; please refer to your course syllabus in the meantime.",
    "num_reviews": 0,
    "num_rating": null,
    "professor": null,
    "difficulty": null,
    "usefulness": null,
    "workload": null
 }
]

[
 {
    "code": "APSC 101",
    "title": "Engineering Design & Practice",
    "units": "3.20",
    "description": "This course develops the ability to conceive, design, and implement solutions in an engineering context via team-based design projects. It develops complex problem solving, teaming, critical thinking, and communication skills, and provides guidance in incorporating safety, ethical, economic, and social factors in engineering problem solving. Examples and project topics are chosen to complement instruction in other first year courses, specifically including programming and graphics. This course is integrated with APSC 199, and coordinated by the same instructors.",
    "hourly_breakdown": "Lec: Yes, Lab: No, Tut: Yes",
    "prerequisites": "N/A",
    "corequisites": "APSC 199",
    "offering_term": "Fall (F)",
    "CEAB": "Mathematics: 0\nNatural Sciences: 0\nComplementary Studies: 13\nEngineering Science: 8\nEngineering Design: 17",
    "offering_faculty": "Smith Engineering",
    "clo": "1. Create and use quantitative models to analyze systems.\n2. Define and deconstruct a complex engineering problem.\n3. Generate and evaluate multiple alternatives, supporting chosen approach.\n4. Design, implement, and evaluate a simple prototype.\n5. Evaluate performance of design relative to specifications and theoretical predictions.\n6. Identify, organize, and critically evaluate information from an appropriate range of sources.\n7. Takes initiative to plan, organize, and complete task as an individual and team member, in order to meet goals.\n8. Seek and integrate diverse and alternative viewpoints, including Indigenous perspectives where applicable, in decision-making.\n9. Provides effective feedback to peers.\n10. Produce clear, concise, precise and well-organized written communication with language appropriate for the audience.\n11. Produce graphical elements that are generally well designed, and support the main purpose.\n12. Describes how safety is integral to producing effective solutions from start to finish.\n13. Integrate appropriate standards, codes, legal and regulatory factors throughout design activities.\n14. Incorporate concepts of sustainable design and development into engineering activities.\n15. Identify and resolve potential ethical issues using ethical principles and codes.\n16. Intentionally incorporate principles of fairness, access and opportunity into decision making.\n17. Evaluate and reflect on own knowledge, skills and learning.",
    "num_reviews": 0,
    "num_rating": null,
    "professor": null,
    "difficulty": null,
    "usefulness": null,
    "workload": null
 },

 {
    "code": "APSC 102",
    "title": "Experimentation",
    "units": " ",
    "description": "This course introduces concepts of planning and designing experiments to determine or measure particular system characteristics. The course content includes laboratory data collection, error analysis, data analysis and visualization, lab safety, occupational hazards, and the design of experimental investigation for simple systems.",
    "hourly_breakdown": "Lec: No, Lab: Yes, Tut: Yes",
    "prerequisites": "N/A",
    "corequisites": "APSC 100",
    "offering_term": "Fall (F) / Winter (W)",
    "CEAB": "Mathematics: 0\nNatural Sciences: 24\nComplementary Studies: 0\nEngineering Science: 0\nEngineering Design: 0",
    "offering_faculty": "Smith Engineering",
    "clo": "1. Appraises the validity of conclusion relative to the degrees of error and limitations of theory and measurement.\n2. Designs investigations involving information and data gathering, analysis, and/or experimentation.\n3. Follows safety protocol in a laboratory environment.\n4. Generates ideas and working hypothesis when presented a research question.\n5. Synthesizes data and information to reach conclusion.\n6. Uses basic experimental equipment.",
    "num_reviews": 0,
    "num_rating": null,
    "professor": null,
    "difficulty": null,
    "usefulness": null,
    "workload": null
 },

 {
    "code": "APSC 103",
    "title": "Engineering Client-based Design Project",
    "units": "3.50",
    "description": "This client-based team design project develops skills including design, project management, technical communications, and professionalism in an experience emulating professional practice. Students work in teams to define problems, gather and identify appropriate information, work effectively with teammates, generate ideas, select ideas, and implement a solution to a problem presented by a client.",
    "hourly_breakdown": "Lec: Yes, Lab: No, Tut: Yes",
    "prerequisites": "APSC 101, APSC 199",
    "corequisites": "APSC 100, MREN 103",
    "offering_term": "Winter (W)",
    "CEAB": "Mathematics: 0\nNatural Sciences: 0\nComplementary Studies: 18\nEngineering Science: 8\nEngineering Design: 16",
    "offering_faculty": "Smith Engineering",
    "clo": "1. Work effectively and harmoniously with different learning styles and personalities.\n2. Apply project management principles and concepts (budgeting time and money, project planning, organizing meetings) to planning, implementing and delivering a client project.\n3. Develop a process that follows established design principles, to generate a solution to a practical problem provided by a client.\n4. Apply principles of science, math and engineering to analyze and generate solutions to complex problems.\n5. Locate, evaluate, and effectively use information in technical communications.\n6. Communicates concisely, articulately and effectively using a variety of mediums (Technical writing, Presentations, Graphics, Formal and Informal communications).\n7. Broadly describe the roles of an engineer and their responsibility and impact on society.\n8. Organize information in a structured report with paragraphs, sections, and transitions.\n9. Support statements and conclusions with reputable, well-organized sources that follow a consistent citation format.\n10. Use appropriate vocabulary and language for a variety of audiences.\n11. Produce graphical elements to support engineering reports and presentations.\n12. Deliver a formal presentation to a client/different audiences with suitable language and content, making concepts clear to a range of audiences.",
    "num_reviews": 0,
    "num_rating": null,
    "professor": null,
    "difficulty": null,
    "usefulness": null,
    "workload": null
 },

 {
    "code": "APSC 111",
    "title": "Physics I",
    "units": "3.30",
    "description": "This course is an introduction to Newtonian mechanics in the context of engineering applications. Lecture topics are: vectors, motion of a particle, particle dynamics, work and energy, statics and dynamics of rigid bodies, conservation of energy, momentum, and collisions.",
    "hourly_breakdown": "Lec: 2.8, Lab: 0, Tut: 0.5",
    "prerequisites": "N/A",
    "corequisites": "N/A",
    "offering_term": "Fall (F)",
    "CEAB": "Mathematics: 0\nNatural Sciences: 40\nComplementary Studies: 0\nEngineering Science: 0\nEngineering Design: 0",
    "offering_faculty": "Smith Engineering",
    "clo": "1. Utilize and apply vector quantities in components or magnitude and direction, including scalar and vector products.\n2. Apply first principles of kinematics to determine the motion in 1, 2 and 3 dimensions of pointlike objectsApply the concept of relative velocity, and vector addition of motion.\n3. Calculate and describe behaviour of rotating objects in a plane through rotational kinematics, including the concept of centripetal acceleration.\n4. Determine the resultant acceleration due to forces using free body diagrams, and work with specific forces such as springs, gravity and friction.\n5. Compute work done by a force, and describe the consequent changes in kinetic energyIdentify conservative forces and their effect on potential energy, and apply first principles to solve dynamics problems using conservation of energy principles.\n6. Describe the concepts linear impulse and linear momentum, and conservation of linear momentum, and apply these principles to calculate the motion of (pointlike) objects undergoing elastic and inelastic collisions.\n7. Determine the centre of mass of a system, for both discrete points and distributed objects.\n8. Analyze the dynamics of rigid bodies rotating in a plane referencing the concepts of torque and rotational kinetic energyCalculate the moment of inertia of rigid bodies, and translate it using the parallel axis theorem.\n9. Describe and calculate mechanical equilibrium of a system using first principles (sum of forces and torques) to solve two-dimensional statics problems.",
    "num_reviews": 0,
    "num_rating": null,
    "professor": null,
    "difficulty": null,
    "usefulness": null,
    "workload": null
 },

 {
    "code": "APSC 112",
    "title": "Physics II",
    "units": "3.30",
    "description": "This course continues from APSC 111 to introduce electricity and further develop fundamental ideas of mechanics in the context of engineering applications. Lecture topics include: oscillations and waves, electric charge, electrical current and resistance, EMF, D.C. circuits and electrical measurements, electric field and potential, magnetic fields and their origin, and electromagnetic induction.",
    "hourly_breakdown": "Lec: 2.8, Lab: 0, Tut: 0.5",
    "prerequisites": "APSC 111, APSC 171",
    "corequisites": "N/A",
    "offering_term": "Winter (W)",
    "CEAB": "Mathematics: 0\nNatural Sciences: 35\nComplementary Studies: 0\nEngineering Science: 5\nEngineering Design: 0",
    "offering_faculty": "Smith Engineering",
    "clo": "1. Calculate and describe the motion of systems in simple harmonic motion such as mass-spring systems and simple pendulums.\n2. Describe and calculate the motion of transverse and longitudinal waves, and work with basic wave phenomena such as superposition, reflection, standing waves, beats and the Doppler effect.\n3. Calculate the electric field due to discrete charges and, using integrals calculate the electric fields due to continuous charge distributions.\n4. Calculate electric potential energy and electric potential for discrete and continuous charge distributions.\n5. Understand the behaviour of current in circuits, and calculate currents and potentials in simple DC circuits.\n6. Understand and describe magnetic fields. Calculate forces and torques on particles and loops in a magnetic field.\n7. Understand the sources of magnetic fields, and calculate the magnetic fields produced by current carrying wires.\n8. Understand and describe magnetic induction, and calculate electromotive forces in circuits due to changing magnetic flux.",
    "num_reviews": 0,
    "num_rating": null,
    "professor": null,
    "difficulty": null,
    "usefulness": null,
    "workload": null
 },

 {
    "code": "APSC 114",
    "title": "Electricity and Magnetism",
    "units": "3.30",
    "description": "This course continues from APSC 111 to introduce electricity and further develope fundamental ideas of mechanics in the context of engineering applications. Leture topics include: oscillations and waves, electric charge, electrical current and sestance, EMF, D.C. circuits and electrical measurements, electric field and potential, magnetic fields and their origin, and electromagnetic induction.",
    "hourly_breakdown": "Lec: 2.8, Lab: 0, Tut: 0.5",
    "prerequisites": "Approval of Associate Dean (Academic)",
    "corequisites": "N/A",
    "offering_term": "Summer (S)",
    "CEAB": "Mathematics: 0\nNatural Sciences: 30\nComplementary Studies: 0\nEngineering Science: 10\nEngineering Design: 0",
    "offering_faculty": "Smith Engineering",
    "clo": "1. Calculate and describe the motion of systems in simple harmonic motion such as mass-spring systems and simple pendulums.\n2. Describe and calculate the motion of transverse and longitudinal waves, and work with basic wave phenomena such as superposition, reflection, standing waves, beats and the Doppler effect.\n3. Calculate the electric field due to discrete charges and, using integrals calculate the electric fields due to continuous charge distributions.\n4. Calculate electric potential energy and electric potential for discrete and continuous charge distributions.\n5. Understand the behaviour of current in circuits, and calculate currents and potentials in simple DC circuits.\n6. Understand and describe magnetic fields. Calculate forces and torques on particles and loops in a magnetic field.\n7. Understand the sources of magnetic fields, and calculate the magnetic fields produced by current carrying wires.\n8. Understand and describe magnetic induction, and calculate electromotive forces in circuits due to changing magnetic flux.",
    "num_reviews": 0,
    "num_rating": null,
    "professor": null,
    "difficulty": null,
    "usefulness": null,
    "workload": null
 },

 {
    "code": "APSC 131",
    "title": "Chemistry of Engineering Materials and Processes",
    "units": "3.30",
    "description": "This course introduces engineering materials and process thermodynamics, with particular emphasis on the central role of chemistry in society's pursuit of the United Nations Sustainable Development Goals. The first unit focuses on structure / property relationships of engineering materials such as metals, semiconductors, ceramics, glasses and polymers. In addition to mechanical properties, specific attributes such as conductivity, photovoltaic activity, viscoelasticity and chemical stability are examined in the context of engineering design decisions. The pressure-volume-temperature dependences of liquid and gas phase properties are also studied. The second unit focuses on the 1st and 2nd laws of thermodynamics as they relate to engineering processes involving heat and work. State functions such as internal energy, enthalpy and entropy are used to define efficiency limitations in energy conversion devices such as engines and heat pumps.",
    "hourly_breakdown": "Lec: 2.8, Lab: 0, Tut: 0.5",
    "prerequisites": "N/A",
    "corequisites": "N/A",
    "offering_term": "Fall (F)",
    "CEAB": "Mathematics: 0\nNatural Sciences: 32\nComplementary Studies: 0\nEngineering Science: 8\nEngineering Design: 0",
    "offering_faculty": "Smith Engineering",
    "clo": "1. Categorize groups of elements in the periodic table related to physical properties.\n2. Differentiate between the different structures of atoms and molecules.\n3. Describe molecular interactions in relation to material properties (solids, liquids, gases).\n4. Describe how the chemical structure of crystalline solids (metallic, ionic, covalent, molecular) and amorphous solids (glasses, polymers) lead to their engineering properties.\n5. Apply knowledge of structure/property relationships to select appropriate engineering materials.\n6. Define an appropriate system boundary and apply the 1st Law to closed and open systems.\n7. Use the 2nd laws of thermodynamics to describe processes involving changes in internal energy, enthalpy, and entropy (efficiency in relation to natural systems, spontaneity).\n8. Apply knowledge of the chemistry of natural and engineered systems to solve problems related to society’s pursuit of the United Nations Sustainable Development Goals (SDGs).",
    "num_reviews": 0,
    "num_rating": null,
    "professor": null,
    "difficulty": null,
    "usefulness": null,
    "workload": null
 },

 {
    "code": "APSC 132",
    "title": "Chemistry of Natural and Engineered Systems",
    "units": "3.30",
    "description": "This course introduces equilibrium thermodynamics, chemical process dynamics and electrochemistry in the context of sustainable engineering design. The first unit defines Gibbs energy as a means of describing the equilibrium state of multi-phase and reactive systems, including acid/base reactions in aqueous solution. The second unit focuses on the rate and mechanism of chemical reactions as well as the physical processes of heat and mass transfer. The third unit deals with principles of electrochemistry as they apply to corrosion and industrial galvanic / electrolytic cells.",
    "hourly_breakdown": "Lec: 2.8, Lab: 0, Tut: 0.5",
    "prerequisites": "APSC 131",
    "corequisites": "N/A",
    "offering_term": "Winter (W)",
    "CEAB": "Mathematics: 0\nNatural Sciences: 25\nComplementary Studies: 0\nEngineering Science: 15\nEngineering Design: 0",
    "offering_faculty": "Smith Engineering",
    "clo": "1. Apply knowledge of the chemistry of natural and engineered systems to solve problems related to society’s pursuit of the United Nations Sustainable Development Goals (SDGs).\n2. Describe phase changes of pure substances and binary mixtures using phase diagrams and simple thermodynamic equilibrium equations.\n3. Apply equilibrium thermodynamic concepts to quantify the state of reversible reaction systems, including acid/base and redox processes.\n4. Formulate differential and integrated kinetic rate equations to describe the dynamics of elementary reactions and their sequences.\n5. Identify heat and mass transfer mechanisms and apply appropriate constitutive models (Fick’s Law, Fourier’s Law) to describe diffusive transport.\n6. Describe and apply equilibrium electrochemistry principles, including half-cell reactions, standard cell potentials, and the Nernst equation to describe galvanic and electrolytic cells as well as corrosion phenomena.",
    "num_reviews": 0,
    "num_rating": null,
    "professor": null,
    "difficulty": null,
    "usefulness": null,
    "workload": null
 },

 {
    "code": "APSC 141",
    "title": "Introduction to Computer Programming for Engineers 1",
    "units": "1.30",
    "description": "This course introduces concepts and practice of computer programming. The emphasis is on the design of correct and efficient algorithms, introducing variables, operators, flow control, and conditions. Applications are made to engineering problems.",
    "hourly_breakdown": "Lec: Yes, Lab: Yes, Tut: No",
    "prerequisites": "N/A",
    "corequisites": "N/A",
    "offering_term": "Fall (F)",
    "CEAB": "Mathematics: 0\nNatural Sciences: 0\nComplementary Studies: 0\nEngineering Science: 12\nEngineering Design: 0",
    "offering_faculty": "Smith Engineering",
    "clo": "1. Describe computational machinery and the relation between computer hardware and software.\n2. Translate complex problems into programmatic flow charts. Convert flow charts into programs.\n3. Declare and initialize variables of various types and apply them within coded expressions translated from symbolic equations.\n4. Translate logical statements to coded conditional statements and create: if, if/else, chained if/else, and switch/case structures.\n5. Construct program sequences as well as achieve looped statements using for, while, and do/while repetition structures.\n6. Analyze real-life engineering problems and create code to achieve solutions while following a systematic approach.\n7. Use proper coding techniques for syntax, indentation, commenting, and variable naming.\n8. Implement debugging strategies to detect, find, and rectify programming errors.",
    "num_reviews": 0,
    "num_rating": null,
    "professor": null,
    "difficulty": null,
    "usefulness": null,
    "workload": null
 },

 {
    "code": "APSC 142",
    "title": "Introduction to Computer Programming for Engineers 2",
    "units": "2.30",
    "description": "This course introduces concepts, theory and practice of computer programming. The emphasis is on the design of correct and efficient algorithms and on programming style, building from APSC 141. Applications are made to engineering problems.",
    "hourly_breakdown": "Lec: Yes, Lab: Yes, Tut: No",
    "prerequisites": "APSC 141",
    "corequisites": "N/A",
    "offering_term": "Winter (W)",
    "CEAB": "Mathematics: 0\nNatural Sciences: 0\nComplementary Studies: 0\nEngineering Science: 28\nEngineering Design: 0",
    "offering_faculty": "Smith Engineering",
    "clo": "1. Correctly index 1D and 2D arrays for assigning and returning element values.\n2. Declare and initialize strings and utilize string functions to manipulate string elements.\n3. Reproduce simple algorithms for searching and sorting 1D arrays, and arrays of strings.\n4. Utilize pointers to access memory addresses and implement the basics of memory allocation and management.\n5. Simplify programs using functions with pass-by-value and pass-by reference inputs and set variable scopes appropriately.\n6. Analyze real-life engineering problems and create code to achieve solutions while following a systematic approach.\n7. Automate requirements testing by writing effective unit and functional tests.\n8. Identify common insecure coding practices and apply mitigations.\n9. Use proper coding techniques for syntax, indentation, commenting, and variable naming.\n10. Implement debugging strategies to detect, find, and rectify programming errors.",
    "num_reviews": 0,
    "num_rating": null,
    "professor": null,
    "difficulty": null,
    "usefulness": null,
    "workload": null
 },

 {
    "code": "APSC 151",
    "title": "Earth Systems Engineering",
    "units": "3.30",
    "description": "This course provides an introduction to the complex Earth System (the solid earth, hydrosphere, atmosphere, and biosphere) and our interactions with it. The science behind our exploration and understanding of our planet and its ongoing evolution is explored in combination with the engineering geology of geo-materials, geo-resources, geo-dynamics and geo-risk. The connection between the Earth System and human activity is explored in depth, including local and global-scale impacts of engineering works, geopolitics, and resource issues. Examples of the terrestrial sources of geo-materials used in engineering activities are highlighted along with the technical, social, economic and environmental challenges associated with their life cycle including sustainability, contamination, biodiversity loss, social impact and climate change.",
    "hourly_breakdown": "Lec: 2.8, Lab: 0.5, Tut: 0",
    "prerequisites": "N/A",
    "corequisites": "N/A",
    "offering_term": "Fall (F)",
    "CEAB": "Mathematics: 0\nNatural Sciences: 18\nComplementary Studies: 10\nEngineering Science: 12\nEngineering Design: 0",
    "offering_faculty": "Smith Engineering",
    "clo": "1. Visualize the components of the Earth System and understand the evolution of, and interactions between the Geosphere, Hydrosphere, Atmosphere and Biosphere.\n2. Describe and differentiate processes of change within the mantle, the crust and on surface in the context of Earth History and the Evolution of Life.\n3. Characterize, classify, identify fundamental minerals and igneous rocks (primary materials) and their engineering properties.\n4. Characterize, classify, identify fundamental minerals and igneous rocks (primary materials) and their engineering properties.\n5. Characterize, classify, identify ongoing processes including deformation, tectonics, weathering, erosion, deposition and glaciation and their impacts on the past, current and future.\n6. Associate societal needs with and human impact on the Earth System.\n7. Associate geological processes and history with engineering properties of geo-materials.\n8. Assess challenges related to surficial engineering geology and ongoing geological, processes including groundwater, geotechnical construction, surface mining and natural hazards.\n9. Assess geological challenges related to underground engineering including tunnelling, waste storage and mining.\n10. Associate geological systems with mineral and energy resources and compare impact of key conventional and alternative energy sources.\n11. Explore the complexities of the mineral resource cycle from discovery, to economic assessment, mining, processing, utilization and recycling.\n12. Develop design alternatives based on georisk, environmental impact and earth material availability.\n13. Construct a framework for the life cycle management of engineering materials derived from the Earth.\n14. Classify, Analyze and Interpret geological structure in order to Interpolate and Extrapolate 3D structural model from 2D surficial data.\n15. Assess GeoRisk from natural and constructed hazards involving the Earth System and Earth Materials and provide mitigation options.\n16. Identify the stakeholders in a mining project, and analyze their value systems and objectives. Propose how your analysis could inform technical decision-making.\n17. Describe key concepts in applied sustainability, particularly with respect to engineering design criteria in relation to the Earth System and Society.\n18. Understand and Personify the expectations associated with Engineering Practice.\n19. Follow established procedures and policies for workplace health and safety.\n20. Establish an atmosphere of inclusion and equity within work teams.",
    "num_reviews": 0,
    "num_rating": null,
    "professor": null,
    "difficulty": null,
    "usefulness": null,
    "workload": null
 },

 {
    "code": "APSC 162",
    "title": "Engineering Graphics",
    "units": "2.50",
    "description": "The principal objectives of the course are (1) to develop the student's ability to visualize and communicate three-dimensional shapes and (2) to acquire the skills needed to use computer-aided design software. Topics covered are orthographic projection, isometric sketching, auxiliary and section views as well as dimensioning and working drawings. Computer-aided design software is used to create solid models of the parts and assemblies as well as to generate dimensioned drawings. Students apply their learning in a project where they design their own version of a consumer product. Students learn by hands-on exercises in free-hand sketching and computer-based drawing.",
    "hourly_breakdown": "Lec: 1.5, Lab: 1, Tut: 0",
    "prerequisites": "N/A",
    "corequisites": "N/A",
    "offering_term": "Fall (F)",
    "CEAB": "Mathematics: 0\nNatural Sciences: 0\nComplementary Studies: 0\nEngineering Science: 20\nEngineering Design: 10",
    "offering_faculty": "Smith Engineering",
    "clo": "1. Sketch freehand orthographic views of object from isometric view.\n2. Sketch freehand an isometric view by visualizing object from orthographic views.\n3. Sketch an auxiliary view from orthographic views.\n4. Sketch freehand a section view from orthographic views.\n5. Demonstrate knowledge of dimensioning, tolerancing, and other drawing conventions.\n6. Demonstrate knowledge of using solid-modelling CAD software.\n7. Design a product satisfying specified constraints.",
    "num_reviews": 0,
    "num_rating": null,
    "professor": null,
    "difficulty": null,
    "usefulness": null,
    "workload": null
 },

 {
    "code": "APSC 171",
    "title": "Calculus I",
    "units": "3.30",
    "description": "Graphs and derivatives of vector-valued functions; related applications. Implicit derivatives and related rate applications. Fundamental Theorem of Calculus, Riemann integral; applications to problems involving areas, volumes, mass, charge, work, etc. Integration by substitution, by parts, and partial fractions. Introduction to second-order differential equations and complex numbers.",
    "hourly_breakdown": "Lec: Yes, Lab: No, Tut: Yes",
    "prerequisites": "N/A",
    "corequisites": "N/A",
    "offering_term": "Fall (F)",
    "CEAB": "Mathematics: 40\nNatural Sciences: 0\nComplementary Studies: 0\nEngineering Science: 0\nEngineering Design: 0",
    "offering_faculty": "Smith Engineering",
    "clo": "1. Constructs mathematical descriptions or expressions to model a real-world problem.\n2. Uses an appropriate derivative-related tool to solve a mathematical problem that arises from modeling a real-world problem.\n3. Uses an appropriate integral-related tool to solve a mathematical problem that arises from modeling a real-world problem.\n4. Uses an appropriate differential equation solution technique or numerical method to solve a mathematical problem that arises from modeling a real-world problem.\n5. Selects and describes appropriate numerical methods to solve mathematical problems that arise from modeling a real-world problem.\n6. Uses solution to mathematical problems to inform the real-world problem that gave rise to it.",
    "num_reviews": 0,
    "num_rating": null,
    "professor": null,
    "difficulty": null,
    "usefulness": null,
    "workload": null
 },

 {
    "code": "APSC 172",
    "title": "Calculus II",
    "units": "3.30",
    "description": "This course continues calculus concepts from APSC 171, including space curves, speed, and velocity. Functions of several variables, partial derivatives, differentials, error estimates, gradient, maxima and minima. Double and triple integrals, polar and cylindrical coordinates; applications to mass, center of mass, moment. Series, power series; Taylor polynomial approximations, error analysis.",
    "hourly_breakdown": "Lec: 2.8, Lab: 0, Tut: 0.5",
    "prerequisites": "APSC 171",
    "corequisites": "N/A",
    "offering_term": "Winter (W)",
    "CEAB": "Mathematics: 40\nNatural Sciences: 0\nComplementary Studies: 0\nEngineering Science: 0\nEngineering Design: 0",
    "offering_faculty": "Smith Engineering",
    "clo": "1. Use an appropriate derivative-related method in two or three dimensions to solve a mathematical problem that arises from modeling a real-world problem.\n2. Construct and use power-series representations as alternative function representations and as function approximations.\n3. Use an appropriate integral-related method in two or three dimensions to solve a mathematical problem that arises from modeling a real-world problem.",
    "num_reviews": 0,
    "num_rating": null,
    "professor": null,
    "difficulty": null,
    "usefulness": null,
    "workload": null
 },

 {
    "code": "APSC 174",
    "title": "Introduction To Linear Algebra",
    "units": "3.30",
    "description": "Systems of linear equations; real vectors spaces and subspaces; linear combinations and linear spans; linear dependence and linear independence; applications to systems of linear equations and their solution via Gaussian elimination; bases and dimension of real vector spaces; linear transformations, range, kernel and Rank-Nullity theorem; matrix representation of a linear transformation; composition of linear transformations and matrix multiplication; invertible matrices and determinants; eigenvalues and eigenvectors of square matrices. Applications of the course material to engineering systems are illustrated.",
    "hourly_breakdown": "Lec: 2.8, Lab: 0, Tut: 0.5",
    "prerequisites": "Associate Dean (Academic) approval",
    "corequisites": "N/A",
    "offering_term": "Fall (F), Winter (W), Summer (S)",
    "CEAB": "Mathematics: 40\nNatural Sciences: 0\nComplementary Studies: 0\nEngineering Science: 0\nEngineering Design: 0",
    "offering_faculty": "Smith Engineering",
    "clo": "1. Solve parametrized and unparametrized systems of linear equations using Gaussian elimination and back substitution by applying elementary row operations on an augmented matrix; for parametrized systems also determine the number of solutions as a function of the parameter.\n2. Perform basic matrix algebraic operations (addition, scaling, multiplication), and compute and utilize properties of the determinant of a real n x n matrix (including using it to assess whether a matrix is invertible).\n3. Explain the mathematical concept of a real vector space, and determine whether a given subset of a vector space is a vector subspace by working with both the usual Euclidean space Rn and other vector spaces.\n4. Demonstrate an understanding of linear combination, linear dependence, linear span, basis and dimension by: i) determining whether a given vector in is the linear span of a family of vectors and whether that family of vectors is linearly independent, ii) computing a basis for a given vector space and its dimension.\n5. Define a linear mapping between vector spaces and determine if a given mapping is linear.\n6. Define the kernel and image of a linear mapping, compute them for a given real matrix, and explain how they are related to the column vectors of that matrix.\n7. Define eigenvalues, eigenspaces and eigenvectors for a given vector space endomorphism and compute them for a real n x n matrix.\n8. Prove linear algebraic results for general vector spaces with mathematical reasoning and in precise mathematical language, combining concepts such as vector subspaces, linear span, linear independence, linear mapping, and eigenvalues/eigenspaces/eigenvectors.",
    "num_reviews": 0,
    "num_rating": null,
    "professor": null,
    "difficulty": null,
    "usefulness": null,
    "workload": null
 },

 {
    "code": "APSC 182",
    "title": "Applied Engineering Mechanics",
    "units": "1.70",
    "description": "Identification, visualization and quantification of forces on elements and forces within statically determinate engineering structures and systems. Two- and three-dimensional force equilibrium of rigid bodies; force distribution within engineering systems like simple trusses, frames and machines; internal shear forces and bending moments in force carrying elements; and engineering stress and strain.",
    "hourly_breakdown": "Lec: 1.45, Lab: 0, Tut: 0.25",
    "prerequisites": "N/A",
    "corequisites": "N/A",
    "offering_term": "Fall (F) / Winter (W)",
    "CEAB": "Mathematics: 0\nNatural Sciences: 0\nComplementary Studies: 0\nEngineering Science: 15\nEngineering Design: 5",
    "offering_faculty": "Smith Engineering",
    "clo": "1. Draw free-body diagrams.\n2. Identify equations of equilibrium.\n3. Solve trusses.\n4. Calculate internal forces.\n5. Create shear force and bending moment diagrams.\n6. Solve a frame.\n7. Evaluate stresses and strains.\n8. Calculate displacements.",
    "num_reviews": 0,
    "num_rating": null,
    "professor": null,
    "difficulty": null,
    "usefulness": null,
    "workload": null
 },

 {
    "code": "APSC 199",
    "title": "Engineering Communications 1",
    "units": "0.50",
    "description": "This course develops skills that are necessary to organize and present technical information in a professional context. It will develop skills relevant to technical and non-technical audiences, including effective argumentation, structure, concision, and vocabulary. Students will demonstrate proficiency in spoken and written English relevant to engineering activities. This course is integrated with APSC 101, and coordinated by the same instructors.",
    "hourly_breakdown": "Lec: Yes, Lab: No, Tut: No",
    "prerequisites": "N/A",
    "corequisites": "N/A",
    "offering_term": "Fall (F)",
    "CEAB": "Mathematics: 0\nNatural Sciences: 0\nComplementary Studies: 6\nEngineering Science: 0\nEngineering Design: 0",
    "offering_faculty": "Smith Engineering",
    "clo": "1. Organize information in structured (report) writing with paragraphs, sections, and transitions.\n2. Support statements and conclusions with evidence and acknowledge limitations and uncertainties.\n3. Use appropriate vocabulary and language for a specific audience.\n4. Create graphical elements to support an idea or purpose within a document.\n5. Deliver informal presentations to a small group with suitable language and content, making concepts clear to the audience.\n6. Respond to oral presentations with insightful questions and suggestions.",
    "num_reviews": 0,
    "num_rating": null,
    "professor": null,
    "difficulty": null,
    "usefulness": null,
    "workload": null
 },

 {
    "code": "APSC 221",
    "title": "Economic and Business Practice",
    "units": "3.00",
    "description": "This course will provide students in the Engineering program with the ability to appropriately incorporate selected economic and business practices into the practice of engineering. The topics covered include introductions to: cost concepts, cost estimation, time value of money, cash flow analysis, the effects of taxes and inflation on project economics, replacement analysis, risk and change management, and financial strength and viability of a new business venture. Assignments and examples are based on situations from engineering-based industries. This is an online course but requires students to write in-person examinations (mid-terms and final) at Queen's University during the Fall and Winter Terms (during the Summer Term, all examinations are completed online).",
    "hourly_breakdown": "Lec: Yes, Lab: No, Tut: No",
    "prerequisites": "N/A",
    "corequisites": "N/A",
    "offering_term": "Fall (F), Winter (W), Summer (S)",
    "CEAB": "Mathematics: 0\nNatural Sciences: 0\nComplementary Studies: 36\nEngineering Science: 0\nEngineering Design: 0",
    "offering_faculty": "Smith Engineering",
    "clo": "1. Recognise different cost concepts and apply them using a variety of cost estimation techniques.\n2. Solve cash flow analysis problems utilizing the time value of money.\n3. Determine the effect of taxes and inflation on project viability.\n4. Apply replacement analysis concepts to determine minimum equivalent annual costs.\n5. Examine risk and change management approaches for project management.\n6. Assess the financial strength and viability of a new venture.\n7. Write a basic business plan.",
    "num_reviews": 0,
    "num_rating": null,
    "professor": null,
    "difficulty": null,
    "usefulness": null,
    "workload": null
 }
]

[
   {
      "code": "ELEC 324",
      "title": "Discrete-Time Signals and Systems",
      "units": "4.00",
      "description": "This second course on signals and systems studies basic concepts and techniques for analysis and modeling of discrete-time signals and systems. The topics of this course are: sampling, reconstruction, and digitization; representations and properties of discrete-time signals and systems; linear time-invariant (LTI) systems; difference equations; discrete Fourier series; discrete-time Fourier transform; discrete Fourier transform; z-transform; analysis of LTI systems; filtering and spectral analysis. Computational realizations of the analysis tools and their applications are explored in the laboratory.",
      "hourly_breakdown": "Lec: Yes, Lab: Yes, Tut: yes",
      "prerequisites": "ELEC 224",
      "corequisites": "N/A",
      "offering_term": "Fall (F)",
      "CEAB": "Mathematics: 12\nNatural Sciences: 0\nComplementary Studies: 0\nEngineering Science: 36\nEngineering Design: 0",
      "offering_faculty": "Smith Engineering",
      "clo": "1. Relate analog and discrete-time signals in terms of the sampling theorem.Represent and analyse discrete-time signals in time and frequency domains.\n2. Represent and analyse discrete-time signals in time and frequency domains.\n3. Characterize signal transformations as systems and in terms of system properties.\n4. Characterize LTI systems in time, frequency, and z domains.\n5. Experimentally investigate the effects of sampling, choice of sampling frequency, and practical reconstruction.\n6. Apply discrete Fourier transform to generate spectrograms for spectral analysis of complex signals.",
      "num_reviews": 0,
      "num_rating": null,
      "professor": null,
      "difficulty": null,
      "usefulness": null,
      "workload": null
},

{
    "code": "ELEC 326",
    "title": "Probability & Random Processes",
    "units": "3.50",
    "description": "This course provides an introduction to probabilistic models and methods for addressing uncertainty and variability in engineering applications. Topics include sample spaces and events, axioms of probability, conditional probability, independence, discrete and continuous random variables, probability density and cumulative distribution functions, functions of random variables, and random processes.",
    "hourly_breakdown": "Lec: Yes, Lab: No, Tut: yes",
    "prerequisites": "APSC 171",
    "corequisites": "N/A",
    "offering_term": "Fall (F)",
    "CEAB": "Mathematics: 36\nNatural Sciences: 0\nComplementary Studies: 0\nEngineering Science: 6\nEngineering Design: 0",
    "offering_faculty": "Smith Engineering",
    "clo": "1. dDescribe different types of random variables and identify important distributions.\n2. Discuss the law of large numbers and asymptotic behaviours, and the concept of information and entropy.\n3. Characterize and identify distribution of functions of multiple random variables and well-known random and point processes.\n4. Apply probability theory for modeling uncertainties involved in engineering problems.\n5. Solve problems involving probably with conditional probabilities.\n6. Calculate different statistics of random variables by manipulating one and two random variables and working with joint distributions.",
    "num_reviews": 0,
    "num_rating": null,
    "professor": null,
    "difficulty": null,
    "usefulness": null,
    "workload": null
 }
 {
    "code": "ELEC 333",
    "title": "Electric Machines",
    "units": "4.25",
    "description": "An introduction to the basic principles, operating characteristics, and design of electric machines. Topics to be studied include: three-phase circuits; magnetic circuits; transformers; steady state behaviours of dc generators and motors; rotating magnetic fields; steady state operation of induction machines and synchronous machines; introduction to fractional horsepower machines; speed control of electric motors.",
    "hourly_breakdown": "Lec: 3, Lab: 0.75, Tut: 0.5",
    "prerequisites": "ELEC 221",
    "corequisites": "N/A",
    "offering_term": "Winter (W)",
    "CEAB": "Mathematics: 0\nNatural Sciences: 13\nComplementary Studies: 0\nEngineering Science: 25\nEngineering Design: 13",
    "offering_faculty": "Smith Engineering",
    "clo": "1. Understand magnetic materials and their application in energy transfer devices / equipment, including transformers, DC machines, AC induction machines and as synchronous machines.\n2. Understand the equivalent circuits for transformers, DC motors, DC generators, AC induction motor and AC synchronous generators and motors.\n3. Analyze the performance of a power system comprising the transformers, DC generators and AC synchronous generators.\n4. Evaluate the performance of a driving system comprising DC motors and / or AC synchronous generators.\n5. Perform the transformer testing and transformer equivalent parameters measurement (PA).\n6. Use three phase induction motor and determine the inductor motor equivalent parameters by no load and blocked load tests. (PA)",
    "num_reviews": 0,
    "num_rating": null,
    "professor": null,
    "difficulty": null,
    "usefulness": null,
    "workload": null
 },

 {
    "code": "ELEC 353",
    "title": "Electronics II",
    "units": "4.25",
    "description": "Transistor-level modeling and design of analog and digital electronic circuits. Differential amplifiers, Gilbert Cell multipliers, multi-stage amplifiers, amplifier frequency response, negative feedback amplifiers, LC-tank and crystal oscillators, two-port networks. Advanced concepts in logic design. Students learn the basics of computer aided design (CAD) of integrated circuits including schematic simulation, layout, design rules, layout versus schematic verification and extracted circuit simulation. Laboratory work is design-oriented and students are introduced to advanced test and measurement techniques using vector network analyzers.",
    "hourly_breakdown": "Lec: 3, Lab: 0.75, Tut: 0.5",
    "prerequisites": "ELEC 252",
    "corequisites": "ELEC 224 or MREN 223 or MTHE 335 or ENPH 316",
    "offering_term": "Fall (F)",
    "CEAB": "Mathematics: 0\nNatural Sciences: 0\nComplementary Studies: 0\nEngineering Science: 38\nEngineering Design: 13",
    "offering_faculty": "Smith Engineering",
    "clo": "1. Describe which circuit components determine the lower 3-dB cutoff frequency of an amplifier's gain response and which circuit components determine the upper 3-dB cutoff frequency of the gain response.\n2. Identify which type of negative feedback arrangement (e.g. shunt sampling/series mixing, etc.) to use for a voltage amplifier, a current amplifier, a transconductance amplifier and a transimpedance amplifier.\n3. Calculate the differential gain (Ad), the common mode gain (Acm) and common mode rejection ratio (CMRR) of a differential amplifier.\n4. Calculate the gain of an amplifier with negative feedback.\n5. Measurement of differential amplifiers and amplifiers with/without feedback as a function of frequency.\n6. Students as a group discuss, explain and identify issues and results in the laboratory and report on them.",
    "num_reviews": 0,
    "num_rating": null,
    "professor": null,
    "difficulty": null,
    "usefulness": null,
    "workload": null
 },

 {
    "code": "ELEC 371",
    "title": "Microprocessor Interfacing and Embedded Systems",
    "units": "4.00",
    "description": "Microprocessor-based system organization and address decoding; memory technology and memory interfaces; parallel input/output interface design; assembly-language and high-level-language programming; interrupts and exceptions; timers; embedded systems organization and design considerations; integration in microcontrollers and programmable logic chips; interfacing with sensors and actuators; embedded system case studies.",
    "hourly_breakdown": "Lec: 3, Lab: 0.5, Tut: 0.5",
    "prerequisites": "ELEC 271, ELEC 274 or CISC 221",
    "corequisites": "N/A",
    "offering_term": "Fall (F)",
    "CEAB": "Mathematics: 0\nNatural Sciences: 0\nComplementary Studies: 0\nEngineering Science: 36\nEngineering Design: 12",
    "offering_faculty": "Smith Engineering",
    "clo": "1. Describe the organization and behavior of hardware for supporting interrupts, and write appropriate code sequences in assembly language to initialize hardware for and respond to interrupt requests.\n2. Describe concepts and design issues related to embedded systems and system-on-chip implementation involving microcontrollers and field-programmable logic chips, highlighting similarities and differences.\n3. Design the address space and the address decoding logic for specified memory and input/output components in an embedded system, and analyze the memory-interface timing for execution of load/store instructions.\n4. Write a program in the C language for a specified embedded application involving the use of parallel input/output ports and a hardware timer with interrupt capability.",
    "num_reviews": 0,
    "num_rating": null,
    "professor": "Naraig Manjikian",
    "difficulty": null,
    "usefulness": null,
    "workload": null
 },

 {
    "code": "ELEC 372",
    "title": "Numerical Methods and Optimization",
    "units": "3.50",
    "description": "Number representation in digital computers, error analysis, and iterative calculations. Methods for finding roots of equations, solving systems of linear algebraic equations, single- and multi-variable optimization, least-squares analysis, curve fitting, differentiation and integration, and solving ordinary differential equations. Implementation of numerical algorithms in software.",
    "hourly_breakdown": "Lec: 3, Lab: 0.5, Tut: 0",
    "prerequisites": "APSC 142 or APSC 143 or MNTC 313, APSC 174, MTHE 235 or MTHE 237 or MTHE 225",
    "corequisites": "N/A",
    "offering_term": "Winter (W)",
    "CEAB": "Mathematics: 21\nNatural Sciences: 0\nComplementary Studies: 0\nEngineering Science: 21\nEngineering Design: 0",
    "offering_faculty": "Smith Engineering",
    "clo": "1. Show numbers in binary and decimal as scientific representation (e.g., IEEE 754 Format) and compute error analysis.\n2. Solve a system of linear equations numerically using different methods (e.g., Gaussian elimination, Gaussian-Seidel).\n3. Find an approximation of unknown values that fall between known pairs of values using various numerical interpolation methods (e.g., Vandermonde method and Lagrange interpolating polynomials).\n4.Find mathematical relationships between given data pairs as input-output using linear and non-linear regression methods.\n5.Approximate numerical differentiation and integration using various methods.\n6.Solve Initial-Value Problems (IVP) (i.e., an ordinary differential equation (ODE) together with an initial condition) numerically.\n7.Solve Single-Variable Optimization problems (e.g., roots finding) as well as Multi-Variable Optimization problems using various numerical methods.\n8.Describe different (practical) optimization problems through linear programming (LP) optimization problems, and solve those problems graphically and/or using the simplex method.\n9.Use MATLAB to represent that data format and to implement related methods and algorithms learned during the course (e.g., interpolating methods, solving the system of linear equations and roots finding).",
    "num_reviews": 0,
    "num_rating": null,
    "professor": null,
    "difficulty": null,
    "usefulness": null,
    "workload": null
 },

 {
    "code": "ELEC 373",
    "title": "Computer Networks",
    "units": "3.50",
    "description": "Network architecture with physical, data link, network, and transport layers for frame transmission and packet switching, standards such as Ethernet and 802.11 for wired and wireless networks, protocols such as TCP/IP, internetworking, routing, and socket programming.",
    "hourly_breakdown": "Lec: 3, Lab: 0, Tut: 0.5",
    "prerequisites": "ELEC 326 or MTHE 351 (STAT 351), ELEC 274 or CISC 221",
    "corequisites": "N/A",
    "offering_term": "Winter (W)",
    "CEAB": "Mathematics: 0\nNatural Sciences: 0\nComplementary Studies: 0\nEngineering Science: 31\nEngineering Design: 11",
    "offering_faculty": "Smith Engineering",
    "clo": "1. CLOs coming soon; please refer to your course syllabus in the meantime.",
    "num_reviews": 0,
    "num_rating": null,
    "professor": "Thomas Dean",
    "difficulty": null,
    "usefulness": null,
    "workload": null
 },

 {
    "code": "ELEC 374",
    "title": "Digital Systems Engineering",
    "units": "4.25",
    "description": "High-performance logic design for arithmetic circuits; memory system designs based on static and dynamic RAMs; computer bus protocols and standard I/O interfaces; mass storage devices; hardware description languages (VHDL, Verilog); fault testing, design for testability, built-in self-test, memory testing, and boundary-scan architectures; asynchronous sequential circuit design; introduction to GPU architectures and GPU computing. The course is supplemented by a CPU design project that allows students to become proficient with Field Programmable Gate Array (FPGA) devices and associated CAD tools, as well as with GPU computing through nVidia CUDA or OpenCL languages.",
    "hourly_breakdown": "Lec: 3, Lab: 1, Tut: 0.25",
    "prerequisites": "ELEC 252, ELEC 271, ELEC 274 or permission of the instructor",
    "corequisites": "N/A",
    "offering_term": "Winter (W)",
    "CEAB": "Mathematics: 0\nNatural Sciences: 0\nComplementary Studies: 0\nEngineering Science: 28\nEngineering Design: 23",
    "offering_faculty": "Smith Engineering",
    "clo": "1. Write the behavioral and structural description of combinational and sequential circuits using Verilog or VHDL .\n2. Describe the internal organization and the logical/timing interface of various memory subsystems including asynchronous/synchronous static, dynamic, and flash memory, as well as understand computer bus protocols and I/O interfaces.\n3. Describe the concepts of data-level parallelism, CUDA/OpenCL kernel functions and threading for GPU architectures.\n4. Analyze/design testable combinational and sequential circuits using techniques such as D-algorithm, Design for Testability (DFT), Built-In-Self-Test (BIST) and Boundary-Scan Architecture.\n5. Analyze/design various high-performance digital circuits for fixed-point and floating-point arithmetic operations such as array multipliers, Booth algorithm, array dividers and multiplicative division, etc.\n6. Analyze/design race-free asynchronous sequential circuits using the flow table, merger diagram and transition diagram.\n7. Design, simulate, implement, and verify the datapath and control unit of a processor using Verilog/VHDL, with/without schematic design.\n8. Effectively communicate the outcome of the lab CPU design team project through a final report and design documentation.",
    "num_reviews": 0,
    "num_rating": null,
    "professor": "Ahmad Afsahi",
    "difficulty": null,
    "usefulness": null,
    "workload": null
 },

 {
    "code": "ELEC 376",
    "title": "Software Development Methodology",
    "units": "3.50",
    "description": "Methodology for object-oriented software design and implementation, modeling notations/languages, template libraries, considerations for graphical user interfaces, techniques and tools for managing software projects in teams, and documentation for requirements analysis and system design.",
    "hourly_breakdown": "Lec: 3, Lab: 0, Tut: 0.5",
    "prerequisites": "ELEC 278",
    "corequisites": "N/A",
    "offering_term": "Fall (F)",
    "CEAB": "Mathematics: 0\nNatural Sciences: 0\nComplementary Studies: 0\nEngineering Science: 21\nEngineering Design: 21",
    "offering_faculty": "Smith Engineering",
    "clo": "1. Develop software requirements specification for a medium-sized project.\n2. Develop System Design Document for a medium-sized project.\n3. Recall software development methodology concepts.\n4. Use C++ features from basic to more advanced such as inheritance and polymorphic functions.\n5. Implement medium-sized console and GUI programs in both procedural and object-oriented paradigms.\n6. Implement a larger software project as a member of an agile programming team.\n7. Apply software project management best practices in the collaborative development of large software project.",
    "num_reviews": 0,
    "num_rating": null,
    "professor": "Mariam Guizani",
    "difficulty": null,
    "usefulness": null,
    "workload": null
 },

 {
    "code": "ELEC 377",
    "title": "Operating Systems",
    "units": "4.00",
    "description": "Operating systems for conventional shared memory computers. System services and system calls, concurrent processes and scheduling, synchronization and communication, deadlock. File systems and protection, memory management and virtual memory, device management and drivers. Unix operating system. Real-time and distributed systems. Security.",
    "hourly_breakdown": "Lec: 3, Lab: 1, Tut: 0",
    "prerequisites": "ELEC 274 or CISC 221 and ELEC 278 or CISC 235",
    "corequisites": "N/A",
    "offering_term": "Fall (F)",
    "CEAB": "Mathematics: 0\nNatural Sciences: 0\nComplementary Studies: 0\nEngineering Science: 26\nEngineering Design: 22",
    "offering_faculty": "Smith Engineering",
    "clo": "1. Describe and analyze scheduling algorithms. Describe criteria for evaluating scheduling algorithms.\n2. Describe process synchronization techniques. Describe the requirements of synchronization and synchronization primitives used modern languages and libraries.\n3. Recognize and describe invasive techniques to exploit a system, types and levels of security and security defenses. Exploit a simple security vulnerability. \n4. Define deadlocks and the four criteria that lead to deadlock. Able to draw Resource allocation graphs, and identify prevention, avoidance, and detection.\n5. Write shell scripts and system programming. Prepare non-trivial shell scripts and system programs using standard Linux utilities, temporary files and pipes to meet a requirement.\n6. Describe the use of Process Control Blocks to contain information about processes. Describe the operating systems concepts of process and thread, explain the various states a process or  thread may be in at any instant of time, and explain the transitions between these states and the reasons why those transitions occur.\n7. Describe the organization of secondary storage, file systems, and error recovery.\n8. Explain how a program’s logical address space is bound to physical memory addresses, the concept of virtual memory, and various memory allocation and paging techniques.",
    "num_reviews": 0,
    "num_rating": null,
    "professor": "Thomas Dean",
    "difficulty": null,
    "usefulness": null,
    "workload": null
 },

 {
    "code": "ELEC 379",
    "title": "Algorithms with Engineering Applications",
    "units": "4.00",
    "description": "Algorithm analysis to characterize running time, and to prove correctness with loop invariants based on induction; algorithm design techniques based on divide and conquer, branch and bound, dynamic programming, and the greedy approach; graph algorithms; computer engineering applications such as circuit partitioning and logic circuit technology mapping; computational complexity and NP-completeness.",
    "hourly_breakdown": "Lec: 3, Lab: 0.5, Tut: 0.5",
    "prerequisites": "ELEC 278, ELEC 270 or any discrete mathematics course",
    "corequisites": "N/A",
    "offering_term": "Fall (F)",
    "CEAB": "Mathematics: 0\nNatural Sciences: 0\nComplementary Studies: 0\nEngineering Science: 24\nEngineering Design: 24",
    "offering_faculty": "Smith Engineering",
    "clo": "1. Understand and apply the mathematics for order of growth and recurrences for characterizing algorithm running times.\n2. Understand different algorithmic techniques, characterize their requirements for obtaining optimal solutions, and describe their application to representative problems.\n3. Describe aspects of complexity theory and NP-completeness, including decision algorithms, verification algorithms, complexity classes, and reductions.\n4. Describe graph algorithms, characterize their running times, and apply them to sample problems.\n5. Design/develop an appropriate algorithm for a specified problem, consider issues related to correctness, and characterize running time.",
    "num_reviews": 0,
    "num_rating": null,
    "professor": "Naraig Manjikian",
    "difficulty": null,
    "usefulness": null,
    "workload": null
 },

 {
    "code": "ELEC 381",
    "title": "Applications of Electromagnetics",
    "units": "3.75",
    "description": "Partial differential equation solutions to Maxwell's Equations; Introduction to the Smith chart; uniform plane waves; reflection of plane waves; normal and oblique incidence; analysis and applications of rectangular waveguides; resonant cavities; optical fibres; introduction to antennas; aperture antennas.",
    "hourly_breakdown": "Lec: 3, Lab: 0.25, Tut: 0.5",
    "prerequisites": "ELEC 280 or ENPH 239",
    "corequisites": "N/A",
    "offering_term": "Fall (F)",
    "CEAB": "Mathematics: 0\nNatural Sciences: 0\nComplementary Studies: 0\nEngineering Science: 24\nEngineering Design: 21",
    "offering_faculty": "Smith Engineering",
    "clo": "1. Understand the fundamentals of unguided electromagnetic wave propagation in lossless and lossy media (normal and oblique incidence, reflection and transmission, state of polarization, power flow).\n2. Understand the fundamentals of guided electromagnetic wave propagation in rectangular metallic waveguides and optical fibers and the factors that impact wave propagation (e.g. dispersion, attenuation).\n3. Understand the fundamentals of half-wave dipole antennas, dipole antenna arrays, horn antennas, planar patch antennas.\n4. Use 2D and 3D full-wave electromagnetic simulators to design multiple types of electromagnetic structures.\n5. Design waveguide resonant cavities and waveguide filters.\n6. Design microwave and optical gratings.\n7. Design and simulate dipole, horn and planar patch antennas.",
    "num_reviews": 0,
    "num_rating": null,
    "professor": null,
    "difficulty": null,
    "usefulness": null,
    "workload": null
 },

 {
    "code": "ELEC 392",
    "title": "Engineering Design and Development",
    "units": "3.50",
    "description": "The goal of this course is to prepare students for the definition, design, management, and development of engineering projects and products with a focus on the societal impacts of emerging technologies. Students will deploy engineering design and management methods within the fields of artificial intelligence and mechatronics, working in interdisciplinary teams to apply engineering design practices to ideate, develop, and implement solutions using software and hardware components. Key objectives include applying ethical frameworks to critically reflect and assess the societal impacts of engineered systems while collaborating to prepare professional engineering documents, including project proposals, progress reports, and final reports, and designing, constructing and validating an integrated system to meet project requirements. Specific software and tools that are available for facilitating design and development activity will be introduced and utilized throughout the term.",
    "hourly_breakdown": "Lec: Yes, Lab: Yes, Tut: No",
    "prerequisites": "ELEC 290, ELEC 292, ELEC 226 or ELEC 326, ELEC 371",
    "corequisites": "N/A",
    "offering_term": "Winter (W)",
    "CEAB": "Mathematics: 0\nNatural Sciences: 0\nComplementary Studies: 15\nEngineering Science: 0\nEngineering Design: 27",
    "offering_faculty": "Smith Engineering",
    "clo": "1. Apply ethical frameworks and decision-making within academic and project environments and assess such decisions' impacts, fairness, and outcomes.\n2. Assess the social impact of engineering design and technologies, including their effects on employment, urban mobility, accessibility, and sustainability. \n3. Equitably interact and collaborate on a multidisciplinary team with professional group dynamics.\n4. Reflect on one's own and others' skills inventory and performance.\n5. Prepare engineering documents, including project proposal, and final report.\n6. Develop documentation for the project planning, management, progress, and evaluation of the results.\n7. Apply engineering design theory and methodology to the project.\n8. Design an integrated software/hardware system to meet the requirements and specifications.\n9. Construct and validate the constructed system to determine if it meets specifications and objectives.",
    "num_reviews": 0,
    "num_rating": null,
    "professor": null,
    "difficulty": null,
    "usefulness": null,
    "workload": null
 },

 {
    "code": "ELEC 408",
    "title": "Biomedical Signal and Image Processing",
    "units": "3.50",
    "description": "This is an introductory course in biomedical signal and image acquisition and processing. The signal module includes a review of biopotential (heart, brain, muscle electrical activities) and non-biopotential signals (acoustics and body motions, etc.), time-domain analysis, frequency-domain analysis, and an introduction to linear and non-linear analyses. The image module includes review of major medical imaging modalities (x-ray, computed tomography, magnetic resonance imaging, and ultrasound), image filtering, image registration, and image segmentation. The course concludes with a discussion of pattern recognition in biomedical images using well-known artificial intelligence models for applications in diagnostics, therapeutics, and interventions. Students experimentally practice some of the signal acquisition and processing techniques in the laboratory.",
    "hourly_breakdown": "Lec: 3, Lab: 0.5, Tut: 0",
    "prerequisites": "ELEC 224 or MREN 223 or permission of the instructor",
    "corequisites": "N/A",
    "offering_term": "Winter (W)",
    "CEAB": "Mathematics: 0\nNatural Sciences: 14\nComplementary Studies: 0\nEngineering Science: 14\nEngineering Design: 14",
    "offering_faculty": "Smith Engineering",
    "clo": "1. Describe biomedical signals, their major physiological characteristics, and how they are acquired.\n2. Describe signal types (deterministic, random, chaotic, ...) and characteristics.\n3. Describe and perform standard signal processing techniques, including artifact removal, power estimation, parametric modeling, feature extraction.\n4. Explain how medical images are captured for a number of medical imaging technologies.\n5. Explain image characteristics and how they are related to image quality.\n6. Use appropriate processing tools, analyze, enhance and extract information, such as points, corners, edges, objects, from a medical image.\n7. Use pattern recognition techniques in analyzing biomedical signals and images.",
    "num_reviews": 0,
    "num_rating": null,
    "professor": null,
    "difficulty": null,
    "usefulness": null,
    "workload": null
 },

 {
    "code": "ELEC 425",
    "title": "Machine Learning and Deep Learning",
    "units": "3.50",
    "description": "Supervised and unsupervised machine learning methods for regression, classification, clustering, and time series modeling. Methods of fitting models. The problem of overfitting and techniques for addressing it. Deep learning and neural network models. Processes for how to refine/ implement/ test applications of machine/deep learning algorithms.",
    "hourly_breakdown": "Lec: 3, Lab: 0.25, Tut: 0.25",
    "prerequisites": "ELEC 278 or CISC 235 or MREN 178, ELEC 326 or permission of the instructor",
    "corequisites": "N/A",
    "offering_term": "Fall (F)",
    "CEAB": "Mathematics: 11\nNatural Sciences: 0\nComplementary Studies: 0\nEngineering Science: 20\nEngineering Design: 11",
    "offering_faculty": "Smith Engineering",
    "clo": "1. Demonstrate understanding of basic supervised and unsupervised machine learning models.\n2. Demonstrate learning of regression, classification, clustering, and time series modelling.\n3. Demonstrate the understanding of basic architectures of deep learning models.\n4. Develop skills in designing and implementing basic machine learning and deep learning models.\n5. Develop the basic ability to use popular machine learning and deep learning environments.",
    "num_reviews": 0,
    "num_rating": null,
    "professor": null,
    "difficulty": null,
    "usefulness": null,
    "workload": null
 },

 {
    "code": "ELEC 431",
    "title": "Power Electronics",
    "units": "3.25",
    "description": "This course introduces the basic concepts of power electronics, which include power semiconductor devices and switching power converters. Emphasis is placed on the analysis and design of various power electronics circuits. Their industrial application, such as in telecommunications and computing, will also be discussed. More specifically, the course will cover the characteristics of switching devices, especially that of MOSFET. The course will also cover the operation of various switching converters such as phase controlled ACto- DC converters, AC voltage controllers, DC-to-DC switching converters, DC-to-AC inverters and switching power supplies. The requirements and configurations of power systems for telecommunications will be introduced. The techniques to analyze and design these power systems using available components will also be discussed. Computer simulation will be used to analyze the detailed operation of switching converters.",
    "hourly_breakdown": "Lec: 3, Lab: 0.25, Tut: 0",
    "prerequisites": "ELEC 252",
    "corequisites": "N/A",
    "offering_term": "Winter (W)",
    "CEAB": "Mathematics: 0\nNatural Sciences: 0\nComplementary Studies: 0\nEngineering Science: 15\nEngineering Design: 24",
    "offering_faculty": "Smith Engineering",
    "clo": "1. Describe the fundamental characteristics of power semiconductor devices (Diode, SCR, MOSFET, IGBT, BJT, GTO).\n2. Describe and explain the fundamental operation of uncontrolled and controlled rectifiers.\n3. Describe and explain the fundamental operation of DC/DC converters, DC/AC inverters, and resonant converters.\n4. Analyze the behavior/performance of uncontrolled and controlled rectifiers.\n5. Analyze the behavior/performance of DC/DC converters, DC/AC inverters and resonant converters.\n6. Work in a group to apply theoretical learning in conducting experimental work on uncontrolled and controlled rectifiers, DC/DC converters, DC/AC inverters, and resonant converters.\n7. Investigate the effect of non-ideal characteristics of circuit components on the operation of uncontrolled and controlled rectifiers, DC/DC converters, DC/AC inverters, and resonant converters and relate their experimental findings with the theory taught in the class.\n8. Design buck, boost, buck boost, resonant converters by calculating the current and voltage ratings of semiconductor components and other passive components.\n9. Design the HVDC transmission line for long distance power distribution by applying resonant converters.\n10. Design a renewable PV energy source by applying DC/DC converters and DC/AC inverters.",
    "num_reviews": 0,
    "num_rating": null,
    "professor": null,
    "difficulty": null,
    "usefulness": null,
    "workload": null
 },

 {
    "code": "ELEC 433",
    "title": "Energy and Power Systems",
    "units": "3.50",
    "description": "Energy resources and electric power generation with particular emphasis on renewable energy systems such as solar, wind, and biomass; review of balanced and unbalanced 3-phase systems; review of per-unit systems; real and reactive power, sequence networks and unsymmetrical analysis; transmission line parameters; basic system models; steady state performance; network calculations; power flow solutions; symmetrical components; fault studies; short circuit analysis; economic dispatch; introduction to power system stability, operating strategies and control; modern power systems and power converters; DC/AC and AC/DC conversion; and introduction to DC transmission.",
    "hourly_breakdown": "Lec: 3, Lab: 0, Tut: 0.5",
    "prerequisites": "ELEC 333",
    "corequisites": "N/A",
    "offering_term": "Fall (F)",
    "CEAB": "Mathematics: 0\nNatural Sciences: 0\nComplementary Studies: 0\nEngineering Science: 24\nEngineering Design: 18",
    "offering_faculty": "Smith Engineering",
    "clo": "1. Describe the fundamentals of energy resources and distributed energy conversion, power systems modeling and matrix manipulations related to power systems, modern power systems and power electronics converters, DC/AC, AC/DC converters and DC transmission.\n2. Describe optimization methods in power systems operations; economic dispatch, optimal power flow.\n3. Perform load flow analyses, symmetrical component calculations, and analyze balanced and unbalanced three-phase systems, single and three phase transformers, balanced and unbalanced faults.\n4. Using software, carry out the preliminary design and analysis of the different aspects in the power systems.",
    "num_reviews": 0,
    "num_rating": null,
    "professor": null,
    "difficulty": null,
    "usefulness": null,
    "workload": null
 },

 {
    "code": "ELEC 443",
    "title": "Linear Control Systems",
    "units": "4.00",
    "description": "Introduction to linear systems and feedback control. Topics include introduction to automatic control, overview of Laplace transformation, linear models of dynamic systems, time-domain specifications of first and second order systems, stability analysis using Routh-Hurwitz criterion, steady-state error and disturbance rejection, PID control, stability analysis and linear controller design using root locus method, Nyquist criterion, and Bode plots, and introduction to state-space analysis. These methods are applied and tested using software such as MATLAB/Simulink, and laboratory experiments.",
    "hourly_breakdown": "Lec: 3, Lab: 0.5, Tut: 0.5",
    "prerequisites": "ELEC 224 or MTHE 335 or MREN 223",
    "corequisites": "N/A",
    "offering_term": "Fall (F)",
    "CEAB": "Mathematics: 0\nNatural Sciences: 0\nComplementary Studies: 0\nEngineering Science: 15\nEngineering Design: 33",
    "offering_faculty": "Smith Engineering",
    "clo": "1. Understand how to model electrical and mechanical systems.\n2. Understand how the position of poles and zeros impact the transient response of LTI systems.\n3. Determine transfer function of LTI systems and determine the pole and zero locations to meet certain transient performance specifications.\n4. Determine the system stability using locations of the poles.\n5. Use PowerSim, MATLAB Simulink, and experiments to analyze the impacts of proportional, integral and derivative control.\n6. As a group, communicate technical material through the use of calculations and plots and express meaningful conclusions in a concise way.",
    "num_reviews": 0,
    "num_rating": null,
    "professor": null,
    "difficulty": null,
    "usefulness": null,
    "workload": null
 },

 {
    "code": "ELEC 451",
    "title": "Digital Integrated Circuit Engineering",
    "units": "3.25",
    "description": "Review of MOS transistor structure and operation; overview of wafer processing and device implementation, layout and design rules. CMOS gate design; static and dynamic logic; modelling of transients and delays. Clocked circuits; interconnect effects, and I/O. Memory and programmable logic arrays. Technology scaling effects; design styles and flow.",
    "hourly_breakdown": "Lec: 3, Lab: 0.25, Tut: 0",
    "prerequisites": "ELEC 252 , ELEC 271",
    "corequisites": "N/A",
    "offering_term": "Winter (W)",
    "CEAB": "Mathematics: 0\nNatural Sciences: 0\nComplementary Studies: 0\nEngineering Science: 21\nEngineering Design: 18",
    "offering_faculty": "Smith Engineering",
    "clo": "1. Describe the steps of integrated-circuit fabrication processes to form NMOS/PMOS transistors and interconnections using polysilicon and metal.\n2. Describe robust CMOS circuit implementation of flip-flop behavior and relevant considerations for clock signals to ensure reliable operation.\n3. Describe cell, sense-amplifier, and address-decoding circuits for implementation of CMOS-based memory arrays.\n4. Develop a standard-cell physical layout for a schematic CMOS circuit representation.\n5. Characterize the parasitic and load capacitances for a CMOS circuit, and use that characterization to estimate delays for switching behavior.\n6. Design static and dynamic CMOS circuits in schematic representation to implement combinational logic functions.",
    "num_reviews": 0,
    "num_rating": null,
    "professor": null,
    "difficulty": null,
    "usefulness": null,
    "workload": null
 },

 {
    "code": "ELEC 457",
    "title": "Integrated Circuits and System Application",
    "units": "3.50",
    "description": "In the first part of this course modern microelectronic circuits are covered and in the second part these circuits are used in new and emerging applications. Topics include: active and passive filtering circuits, phase locked loops, frequency synthesizers, RF modulators, clock and data recovery circuits, RF energy harvesting, ultra low-power circuits, biotelemetry systems, biological sensors, neurostimulator circuits, introduction to radiometry and radar imaging.",
    "hourly_breakdown": "Lec: 3, Lab: 0.5, Tut: 0",
    "prerequisites": "ELEC 353, ELEC 224 or MTHE 335 or MREN 223",
    "corequisites": "N/A",
    "offering_term": "Fall (F)",
    "CEAB": "Mathematics: 0\nNatural Sciences: 0\nComplementary Studies: 0\nEngineering Science: 21\nEngineering Design: 21",
    "offering_faculty": "Smith Engineering",
    "clo": "1. Describe the basic components and operation of systems such as RFID transmit-receive system, RF-to-DC power conversion system, radar imagers and radiometers systems.\n2. Describe the operation of various biological sensors, neurostimulators, and implantable medical devices and how biotelemetry systems using ASK, FSK, or BPSK modulation work.\n3. Analyze the transient and steady-state operation of a phase locked loop.\n4. Design and analyze passive lumped-element filtering networks, and high-frequency and tunable active filters.\n5. Design and analyze Colpitts oscillators, and low phase-noise oscillators, and frequency mixer circuits.\n6. Design a PLL to have a specified overshoot due to a step change in input phase or frequency.",
    "num_reviews": 0,
    "num_rating": null,
    "professor": null,
    "difficulty": null,
    "usefulness": null,
    "workload": null
 },

 {
    "code": "ELEC 461",
    "title": "Digital Communications",
    "units": "3.50",
    "description": "Representation of signals and noise, Gaussian processes, correlation functions and power spectra. Linear systems and random processes. Performance analysis and design of coherent and noncoherent communication systems, phase-shift-keying, frequency-shift,-keying, and M-ary communication systems. Optimum receivers and signal space concepts. Information and its measure, source encoding, channel capacity and error correcting coding.",
    "hourly_breakdown": "Lec: 3, Lab: 0, Tut: 0.5",
    "prerequisites": "ELEC 324 or MTHE 335 or MREN 223, ELEC 326 or MTHE 351, or permission of instructor",
    "corequisites": "N/A",
    "offering_term": "Winter (W)",
    "CEAB": "Mathematics: 0\nNatural Sciences: 0\nComplementary Studies: 0\nEngineering Science: 21\nEngineering Design: 21",
    "offering_faculty": "Smith Engineering",
    "clo": "1. Use random processes in systems.\n2. Design digital communication systems.\n3. Analyze the function of each building block of digital communication systems.\n4. Use various signal spaces to represent information.\n5. Apply information theory to different systems.\n6. Discuss communication technologies.",
    "num_reviews": 0,
    "num_rating": null,
    "professor": null,
    "difficulty": null,
    "usefulness": null,
    "workload": null
 },

 {
    "code": "ELEC 470",
    "title": "Computer System Architecture",
    "units": "3.50",
    "description": "This course covers advanced topics in computer architecture with a quantitative perspective. Topics include: instruction set design; memory hierarchy design; instruction-level parallelism (ILP), pipelining, superscalar processors, hardware multithreading; thread-level parallelism (TLP), multiprocessors, cache coherency; clusters; introduction to shared-memory and message-passing parallel programming; data-level parallelism (DLP), GPU architectures.",
    "hourly_breakdown": "Lec: 3, Lab: 0, Tut: 0.5",
    "prerequisites": "ELEC 371, ELEC 274 or CISC 221",
    "corequisites": "N/A",
    "offering_term": "Winter (W)",
    "CEAB": "Mathematics: 0\nNatural Sciences: 0\nComplementary Studies: 0\nEngineering Science: 11\nEngineering Design: 31",
    "offering_faculty": "Smith Engineering",
    "clo": "1. Understand quantitative design and analysis of computing systems, as well as the instruction set architecture design for RISC architectures.\n2. Describe the concepts of hierarchical memory subsystems, including multi-level caches, advanced optimization techniques and integration with pipelined processors, as well as virtual memory.\n3. Understand design trade-offs in processor design including pipelined processors, in-order vs. out-of-order execution, branch prediction techniques, different cache and TLB organizations, and through simulation.\n4. Describe software multithreading and multicore computing by writing parallel programs using shared-memory and message-passing programming models.\n5. Analyze/design single-issue pipelined datapath and control unit, realize how structural, data and control hazards can affect performance, and how they can be handled statically or dynamically at runtime.\n6. Analyze/design advanced instruction level parallelism (ILP), including multiple-issue pipelined processors with static scheduling (VLIW), dynamic scheduling and speculation (superscalar), and hardware multithreading.\n7. Analyze/design multicore architectures and shared memory multiprocessors with a focus on thread level parallelism (TLP) and snooping and directory-based cache coherency protocols; as well as data- level parallelism (DLP) and GPU architectures.",
    "num_reviews": 0,
    "num_rating": null,
    "professor": null,
    "difficulty": null,
    "usefulness": null,
    "workload": null
 },

 {
    "code": "ELEC 471",
    "title": "Safety Critical Software Engineering",
    "units": "3.50",
    "description": "Methods and tools for software engineering in safety-critical systems. This is a project-based course where students develop software for a safety-critical real-time system from requirements. Topics include model-based design, hazard analysis, requirements tracing, real-time scheduling, code coverage analysis, coding standards, and formal verification.",
    "hourly_breakdown": "Lec: 3, Lab: 0.5, Tut: 0",
    "prerequisites": "ELEC 271, ELEC 278 or MREN 178, ELEC 371",
    "corequisites": "N/A",
    "offering_term": "Fall (F)",
    "CEAB": "Mathematics: 0\nNatural Sciences: 0\nComplementary Studies: 0\nEngineering Science: 21\nEngineering Design: 21",
    "offering_faculty": "Smith Engineering",
    "clo": "1. CLOs coming soon; please refer to your course syllabus in the meantime.",
    "num_reviews": 0,
    "num_rating": null,
    "professor": null,
    "difficulty": null,
    "usefulness": null,
    "workload": null
 },

 {
    "code": "ELEC 472",
    "title": "Artificial Intelligence",
    "units": "3.50",
    "description": "Fundamental concepts and applications of intelligent and interactive system design and implementation. Topics include: problem formulation and experiment design, search techniques and complexity, decision making and reasoning, data acquisition, data pre-processing (de-noising, missing data, source separation, feature extraction, feature selection, dimensionality reduction), supervised learning, unsupervised learning, and swarm intelligence.",
    "hourly_breakdown": "Lec: 3, Lab: 0.5, Tut: 0",
    "prerequisites": "ELEC 278 or MREN 178, ELEC 326 or permission of the instructor",
    "corequisites": "N/A",
    "offering_term": "Winter (W)",
    "CEAB": "Mathematics: 0\nNatural Sciences: 0\nComplementary Studies: 0\nEngineering Science: 31\nEngineering Design: 11",
    "offering_faculty": "Smith Engineering",
    "clo": "1. Discuss communication technologies.\n2. Learn different methods of informed and uninformed search for problem solving and decision making.\n3. Learn to use logic and inference for decision making.\n4. Learn basic definitions, development, and applications of data preprocessing techniques.\n5. Learn basic definitions, development, and applications supervised and unsupervised machine learning models.\n6. Learn basic definitions, development, and applications of ensemble learning techniques.\n7. Learn basic definitions, development, and applications of evolutionary models.",
    "num_reviews": 0,
    "num_rating": null,
    "professor": null,
    "difficulty": null,
    "usefulness": null,
    "workload": null
 },

 {
    "code": "ELEC 473",
    "title": "Cryptography and Network Security",
    "units": "3.00",
    "description": "Cryptography topics include: block ciphers, advanced encryption standard, public key encryption, hash functions, message authentication codes, digital signatures, key management and distribution, and public-key infrastructure. Network security topics include: user authentication, network access control, Kerberos protocol, transport layer security (TLS), IP security (IPSec), electronic mail security, and wireless network security.",
    "hourly_breakdown": "Lec: 3, Lab: 0, Tut: 0",
    "prerequisites": "ELEC 373 or CISC 435, ELEC 270 or CISC 102 or permission of instructor",
    "corequisites": "N/A",
    "offering_term": "Fall (F)",
    "CEAB": "Mathematics: 0\nNatural Sciences: 0\nComplementary Studies: 0\nEngineering Science: 26\nEngineering Design: 10",
    "offering_faculty": "Smith Engineering",
    "clo": "1. Identify the key security requirements of confidentiality, integrity, availability, authenticity, and accountability.\n2. Identify cyber attacks and security threats, and formulate the problems to be addressed.\n3. Understand design principles and mathematical background of cryptographic algorithms and protocols.\n4. Describe how various cryptographic algorithms and secure network protocols work.\n5. Analyze and evaluate the security of the cryptographic algorithms and protocols.\n6. Apply the design principles to design new cryptographic algorithms that meet the security requirements.\n7. Analyze, design, and implement security protocols and algorithms to achieve certain security goals.\n8. Learn to configure and architect computer network with cryptographic algorithms for maximum wired and wireless security.",
    "num_reviews": 0,
    "num_rating": null,
    "professor": null,
    "difficulty": null,
    "usefulness": null,
    "workload": null
 },

 {
    "code": "ELEC 475",
    "title": "Computer Vision with Deep Learning",
    "units": "3.50",
    "description": "Deep learning methods are highly effective at solving many problems in computer vision. This course serves as an introduction to these two areas and covers both the theoretical and practical aspects required to build effective deep learning-based computer vision applications. Topics include classification, convolutional neural networks, object detection, encoder-decoders, segmentation, keypoint and pose estimation, generative adversarial networks, and transformers. Labs and assignments will emphasize practical implementations of deep learning systems applied to computer vision problems.",
    "hourly_breakdown": "Lec: 3, Lab: 0.5, Tut: 0",
    "prerequisites": "ELEC 292 or (MREN 203 and MREN 223)",
    "corequisites": "N/A",
    "offering_term": "Fall (F)",
    "CEAB": "Mathematics: 0\nNatural Sciences: 0\nComplementary Studies: 0\nEngineering Science: 31\nEngineering Design: 11",
    "offering_faculty": "Smith Engineering",
    "clo": "1. Describe the objectives of Computer Vision, and how these are addressed using Machine Learning methods.\n2. Describe the fundamental Machine Learning structures, including Multi-Layer Perceptrons, Convolutional Neural Networks, and Transformers.\n3. Identify the main problem areas of Machine Learning-based Computer Vision, including Autoencoders, Image Classification, Object Detection, Segmentation, Variational Autoencoders, Generative Adversarial Networks, and Visual Information Transformers.\n4. Explain the major architectural innovations that have advanced the performance of Machine Learning-based Computer Vision.\n5. Implement, train and test Machine Learning-based Computer Vision solutions.",
    "num_reviews": 0,
    "num_rating": null,
    "professor": null,
    "difficulty": null,
    "usefulness": null,
    "workload": null
 },

 {
    "code": "ELEC 477",
    "title": "Distributed Systems",
    "units": "3.00",
    "description": "Client/server architectures, multicasting, real-time distributed protocols, naming and name services, fault tolerance, security, and embedded-systems considerations.",
    "hourly_breakdown": "Lec: 3, Lab: 0, Tut: 0",
    "prerequisites": "ELEC 373, ELEC 377",
    "corequisites": "N/A",
    "offering_term": "Winter (W)",
    "CEAB": "Mathematics: 0\nNatural Sciences: 0\nComplementary Studies: 0\nEngineering Science: 24\nEngineering Design: 12",
    "offering_faculty": "Smith Engineering",
    "clo": "1. Describe the fundamentals of socket programming and protocols used to communicate between systems.\n2. Evaluate issues involved in consistency and replicaAon in distributed storage systems.\n3. Explain algorithms used to distribute computaAon in distributed systems.\n4. Identify issues in naming resources in distributed systems.\n5. Identify issues in timing in distributed systems.\n6. Explain issues in real time embedded systems.",
    "num_reviews": 0,
    "num_rating": null,
    "professor": null,
    "difficulty": null,
    "usefulness": null,
    "workload": null
 },

 {
    "code": "ELEC 490",
    "title": "Electrical Engineering Project",
    "units": "7.00",
    "description": "Students work in groups of three or four on the design and implementation of electrical engineering projects, with the advice of faculty members. This course is intended to give students an opportunity to practice independent design and analysis. Each group is required to prepare an initial engineering proposal, regular progress reports, and a final report together with a formal seminar on the project and its results.",
    "hourly_breakdown": "Lec: Yes, Lab: Yes, Tut: Yes",
    "prerequisites": "ELEC 324, ELEC 326, ELEC 353, ELEC 371, ELEC 372, ELEC 381, ELEC 390, or permission of the department",
    "corequisites": "N/A",
    "offering_term": "Fall (F), Winter (W)",
    "CEAB": "Mathematics: 0\nNatural Sciences: 0\nComplementary Studies: 21\nEngineering Science: 0\nEngineering Design: 63",
    "offering_faculty": "Smith Engineering",
    "clo": "1. Define problem, objectives and constraints, considering health, safety, environmental, economic, regulatory, cultural, societal and stakeholder needs as appropriate.\n2. Effectively plan projects, including mitigating risk and managing change, to complete project on-time and on- budget.\n3. Produce clear, concise, precise and well-organized written communication with language appropriate for the audience.\n4. Take initiative to plan, organize and complete tasks, as an individual and team member, to meet team goals.\n5. Demonstrates capacity for initiative and technical or team leadership while respecting others' roles.\n6. Shows respect for diversity in individuals and roles in a team.\n7. Independently acquire new knowledge and skills relevant to the project.\n8. Applies appropriate techniques, resources, tools, and processes to accomplish a task.\n9. Uses appropriate calculations, models, simulations, analysis, and/or prototypes at various points in design with iteration and complexity appropriate to design stage.\n10. Quantifies performance/yield/efficiency/output at appropriate stages through process to support design iteration and optimization.\n11. Apply economic considerations, such as capital, operating, societal and life cycle costs, to design activity.\n12. Take appropriate action to mitigate risks associated with economic, environmental, health, safety and legal aspects of engineering activities.\n13. Generates a traceable and defensible record of a technical project using an appropriate project records system.\n14. Assesses the reasonableness and effectiveness of assumptions, methods and quality of results against appropriate standards, and draws conclusions and recommend further investigation.\n15. Deliver formal and informal oral presentations with suitable language, content, style, timing and flow, while adapting format, content and tone to audience and purpose.\n16. Uses graphics to explain, interpret, and assess information.\n17. Explains and interprets results for various audiences and purposes.\n18. Evaluate and reflect on your own knowledge, skills and learning.",
    "num_reviews": 0,
    "num_rating": null,
    "professor": null,
    "difficulty": null,
    "usefulness": null,
    "workload": null
 },

 {
    "code": "ELEC 497",
    "title": "Research Project",
    "units": "3.50",
    "description": "The student works on a research project under the supervision of a faculty member. A research problem is formulated and the problem is contextualized within the discipline. The student does a current literature review, and explores in detail a solution to the research problem. Subject to Department approval.",
    "hourly_breakdown": "Lec: No, Lab: No, Tut: No",
    "prerequisites": "Completion of 3rd-year core courses in ELEC, CMPE or MREN program.",
    "corequisites": "N/A",
    "offering_term": "Fall (F), Winter (W), Summer (S)",
    "CEAB": "Mathematics: 0\nNatural Sciences: 0\nComplementary Studies: 0\nEngineering Science: 21\nEngineering Design: 21",
    "offering_faculty": "Smith Engineering",
    "clo": "1. Generates a traceable and defensible record of a technical project using an appropriate project records system.\n2. Explains and interprets results for various audiences and purposes.\n3. Uses graphics to explain, interpret, and assess information.\n4. Constructs appropriate hypotheses, designs experimental procedures to collect data and analyzes data to test hypotheses.",
    "num_reviews": 0,
    "num_rating": null,
    "professor": null,
    "difficulty": null,
    "usefulness": null,
    "workload": null
 }
]