[
    {
        "name": "Naraig Manjikian",
        "courses_teaching": ["ELEC 274", "ELEC 371"],
        "phone": "613-533-6000 ext. 75128",
        "degrees": "PhD, P.Eng",
        "professor_type": "Associate Professor",
        "faculty": "Electrical and Computer Engineering",
        "email": "naraig.manjikian@queensu.ca",
        "office": "Walter Light Hall, Room 423",
        "expertise": ["Computer Architecture", "Parallel Processing", "Field-Programmable Logic"],
        "biography": "Naraig Manjikian received his BASc (Computer Engineering) in 1991 and his MASc (Electrical Engineering) in 1992, both from the University of Waterloo, Waterloo, Ontario, Canada, and he received his PhD (Electrical Engineering) from the University of Toronto in 1997. He is currently an Associate Professor in the Department of Electrical and Computer Engineering at Queen's University. From July 2004 to June 2006, he served as the Chair of Undergraduate Studies for the Computer Engineering program. From July 2006 to December 2006, he served as Acting Head of the Department. From January 2007 to April 2009, he served as Associate Head for Student and Alumni Relations. He is a co-author with Z. Vranesic, C. Hamacher, and S. Zaky of the textbook Computer Organization and Embedded Systems (6th edition) from McGraw-Hill. For the 2014-2015 academic session, he was selected by second-year Electrical Engineering students as a Professor of the Year in recognition of excellence in teaching. For the 2015-2016 academic session, he was selected by third-year Electrical Engineering students and third-year Computer Engineering students as a Professor of the Year. For the 2017-2018 academic session, he was selected by third-year Computer Engineering students and fourth-year Electrical Engineering students as a Professor of the Year. For the 2018-2019 academic session, he was selected by third-year Computer Engineering students as a Professor of the Year. He is a member of the Institute of Electrical and Electronics Engineers, the IEEE Computer Society, and the American Society of Engineering Education."
    },
    {
        "name": "Ahmad Afsahi",
        "courses_teaching": ["ELEC 374", "ELEC 470"],
        "phone": "613-533-3068",
        "degrees": "PhD, P.Eng",
        "professor_type": "Professor, Chair of Graduate Studies",
        "faculty": "Electrical and Computer Engineering",
        "email": "ahmad.afsahi@queensu.ca",
        "office": "Walter Light Hall, Room: 410",
        "expertise": ["Parallel Processing and Systems"],
        "biography": "Ahmad Afsahi received his Ph.D. degree in Electrical Engineering from the University of Victoria, BC, in 2000, and his M.Sc. and B.Sc. degrees in Computer Engineering from Sharif University of Technology and Shiraz University, respectively. He has been on the Faculty at Queen's University since 2000 and currently holds the rank of Professor in the Department of Electrical and Computer Engineering (ECE). His main research activities are in the areas of parallel processing and systems, network-based high-performance computing, communication runtime and system software, hheterogeneous and accelerated computing, parallel programming models, and high-performance communication for deep learning.  His research has earned him a Canada Foundation for Innovation Award, and an Ontario Innovation Trust Award. More information about his research activities and research team can be found at the Parallel Processing Research Laboratory (PPRL). His teaching activities are in the areas of digital systems, computer architecture, and cluster computing. Dr. Afsahi is a licensed Professional Engineer (P. Eng.) in the province of Ontario, a Senior Member of the Institute of Electrical and Electronics Engineers (IEEE), and a Member of the Association for Computing Machinery (ACM)."
    },
    {
       "name": "Muhammad Alam",
        "courses_teaching": ["ELEC 280"],
        "phone": "613-533-6000 ext. 74874",
        "degrees": "PhD, P.Eng",
        "professor_type": "Assistant Professor",
        "faculty": "Electrical and Computer Engineering",
        "email": "m.alam@queensu.ca",
        "office": "Walter Light Hall, Room: 516",
        "expertise": ["Nanophotonics"],
        "biography": "Muhammad Zulfiker Alam is an Assistant Professor at the Department of Electrical and Computer Engineering. He received his BASc from Bangladesh University of Engineering and Technology (2000), MASc from the University of Victoria (2003), and PhD from the University of Toronto (2012). As part of his PhD research, he proposed the hybrid plasmonic waveguide which stimulated worldwide research activity. In recognition of the impact of his research he received the Douglas R. Colton Medal for Research, which is given to one researcher every year in Canada. Subsequently he worked as a postdoctoral fellow at the University of Toronto and Caltech. He was also a visiting researcher at Jet Propulsion Laboratory and Lawrence Berkeley National Laboratory. Dr. Alam’s work has resulted in more than 50 journal and conference publications, and three issued or pending patents. His research interests include metasurface, optoelectronics, plasmonics, and silicon photonics. "
    },
    {
       "name": "Steven Blostein",
        "courses_teaching": ["ELEC 324, ELEC 422, ELEC 886"],
        "phone": "613-770-7670",
        "degrees": "PhD, P.Eng",
        "professor_type": "Professor",
        "faculty": "Electrical and Computer Engineering",
        "email": "steven.blostein@queensu.ca",
        "office": "Walter Light Hall, Room: 415",
        "expertise": ["Communications and Signal Processing"],
        "biography": "Steven D. Blostein received his BS degree in Electrical Engineering from Cornell University, Ithaca, NY, in 1983, and the MS and PhD degrees in Electrical and Computer Engineering from the University of Illinois, Urbana-Champaign, in 1985 and 1988, respectively. He has been on the Faculty at Queen's University since 1988 and currently holds the position of Professor of the Department of Electrical and Computer Engineering. He spent 1994-1995 at Lockheed Martin Electronic Systems in Montreal as a Visiting Associate Professor in the department of Electrical Engineering at McGill University in 1995. From 1999-2003, he was leader of the Multirate Wireless Data Access Major Project sponsored by the Canadian Institute for Telecommunications Research. Since then, he has led multi-university/industry projects related to fourth generation (4G) wireless communications systems. He has also been a consultant to industry and government in the areas of image compression, target tracking, radar imaging and wireless communications. He has collaborated with Communications Research Centre and more recently, with the Australian National University in the area of synchronization in cooperative communications and since 2008 has worked on multicasting multimedia over wireless systems. Over the years he has supervised close to 50 PhD, MASc and post-doctoral students. He has been a member of the World 4G Wireless Forum as well as an invited distinguished speaker. He served as Chair of IEEE Kingston Section (1994), Chair of the Biennial Symposium on Communications in 2000, 2006, and 2008, Member of the NSERC Strategic Grants Committee in Information and Communications Technology (2000-2003), Associate Editor for IEEE Transactions on Image Processing (1996-2000), Publications Chair for IEEE ICASSP 2004 and Associate Editor for IEEE Transactions on Wireless Communication (2007-2013). He has also served on Technical Program Committees for numerous IEEE conferences. He has also held key administrative positions in ECE at Queen's, including Coordinator of Graduate Studies (2000-2003), Associate Head, Research (2002-2003) and Department Head (2004-2009). He is a registered Professional Engineer in Ontario and a Senior Member of IEEE." 
    },
    {
       "name": "Wai-Yip Geoffrey Chan",
        "courses_teaching": ["ELEC 273, ELEC 324, ELEC 421, ELEC 490, ELEC 823, ELEC 827"],
        "phone": "613-533-2939",
        "degrees": "PhD, P.Eng",
        "professor_type": "Professor",
        "faculty": "Electrical and Computer Engineering",
        "email": "geoffrey.chan@queensu.ca",
        "office": "Walter Light Hall, Room: 517",
        "expertise": ["Signal Processing, Machine Learning for Speech and Data Communication, Health Data Modeling"],
        "biography": "Geoffrey Chan received the B.Eng and M.Eng degrees from Carleton University, and the Ph.D degree from the University of California , at Santa Barbara, all in Electrical Engineering. He was previously with Illinois Institute of Technology in Chicago, McGill University in Montreal, and Bell Northern Research (Nortel) and Communications Research Centre in Ottawa. His industry experience ranges from digital signal processing (DSP) algorithm to integrated circuit design. His research interests and collaborations with industry are in DSP and machine learning for analysis, modeling, coding, and enhancement of speech, communications, and health related signals and data. Geoffrey has served as Associate Editor of IEEE Transactions on Audio, Speech, and Language Processing and EURASIP Journal on Audio, Speech, and Music Processing, and as a member on the IEEE Signal Processing Society Speech and Language Technical Committee.  He also served as Technical Program Co-chair of the 2004 and 2006 Biennial Symposium on Communications and of 2000 IEEE Workshop on Speech Coding, and as Organizing Committee Member of the 1998 IEEE International Conference on Image Processing.  At Queen's, he has served as ECE Chair of Graduate Studies, Chair of Undergraduate Studies, and Associate Head of Undergraduate Affairs. He has held a U.S. National Science Foundation CAREER award." 
    },
    {
       "name": "Thomas Dean",
        "courses_teaching": ["APSC 141, APSC 142, ELEC 377, SOFT 423"],
        "phone": " 613-533-6482",
        "degrees": "PhD",
        "professor_type": "Professor",
        "faculty": "Electrical and Computer Engineering",
        "email": "tom.dean@queensu.ca",
        "office": "Walter Light Hall, Room: 407",
        "expertise": ["Software Systems"],
        "biography": "Dr. Thomas R Dean is a Professor in the Department of Electrical and Computer Engineering at Queen's University and an Adjunct Associate Professor at the Royal Military College of Kingston. His background includes research in air traffic control systems, language formalization and five and a half years as a Sr. Research Scientist at Legasys Corporation where he worked on advanced software transformation and evolution techniques in an industrial setting. His current research interests are software transformation, web site evolution and the security of network applications. " 
    },
    {
       "name": "Ali Etemad",
        "courses_teaching": ["ELEC 472, ELEC 292, ELEC 390, ELEC 872"],
        "phone": "613-533-6000 ext. 78862",
        "degrees": "PhD, P.Eng",
        "professor_type": "Associate Professor",
        "faculty": "Electrical and Computer Engineering",
        "email": "ali.etemad@queensu.ca",
        "office": "Walter Light Hall, Room: 408",
        "expertise": ["Nanophotonics"],
        "biography": "Dr. Etemad is an Associate Professor at the Department of Electrical and Computer Engineering, Queen's University. He holds an endowed professorship of Mitchell Professor in AI for Human Sensing & Understanding. His main area of research is human-centered machine learning and deep learning. Dr. Etemad received his M.A.Sc. and Ph.D. degrees in Electrical and Computer Engineering from Carleton University, Ottawa, Canada, in 2009 and 2014, respectively. Prior to joining Queen’s, he held several industry positions as lead scientist. He has published over 170 papers in top venues in the area (e.g., NeurIPS, ICLR, AAAI, CVPR, T-PAMI, ECCV, ICCV, etc.), is a co-inventor of 10 patents, and has given over 30 invited talks. Dr. Etemad is an Associate Editor for IEEE Transactions on Affective Computing and IEEE Transactions on Artificial Intelligence. He has served as a PC member/reviewer, and has held organizing roles at various venues. He has received a number of awards including Prize for Excellence in Research, Supervisor of the Year Award, Instructor of the Year Award, and several Best Paper Awards (e.g., at ACM ICMI'23). Dr. Etemad’s lab and research program have been funded by the Natural Sciences and Engineering Research Council (NSERC) of Canada, Ontario Centers of Excellence (OCE), Canadian Foundation for Innovation (CFI), Mitacs, and other organizations, as well as the private sector. He has held visiting faculty positions at the University of Cambridge and Google Research." 
    },
    {
       "name": "Brian M Frank",
        "courses_teaching": ["ELEC 252, APSC 101"],
        "phone": "613-533-6000 ext. 75426",
        "degrees": "PhD, P.Eng, FEC, FCEEA",
        "professor_type": "Professor; DuPont Canada Chair in Engineering Education Research and Development",
        "faculty": "Electrical and Computer Engineering",
        "email": "brian.frank@queensu.ca",
        "office": "Walter Light Hall, Room: 701",
        "expertise": ["Education and Assessment", "Integrated Circuits and Electronics", "Antennas"],
        "biography": "Dr. Brian Frank (M'2002) received the BASc, MASc and PhD degrees in electrical engineering from Queen's University in Kingston, Ontario, Canada in 1997, 1999 and 2002 respectively. He is the DuPont Canada Chair in Engineering Education Research and Development  in the Stephen J.R. Smtih Faculty of Engineering and Applied Science, and Professor in the Department of Electrical and Computer Engineering. From 2004-2006 he was an Educational Development Faculty Associate in the Instructional Development Centre, now the Centre for Teaching and Learning (CTL). From 2008 to 2016 he served as the Director of Program Development in the Stephen J. R. Smith Faculty of Engineering and Applied Science, and as Associate Dean (Teaching and Learning) from 2016 to 2021. He is currently a supporting the Smith Engineering Reimagination of Engineering Education as a member of the Guiding Team. " 
    },
    {
       "name": "Saeed Gazor",
        "courses_teaching": ["ELEC 326, ELEC 461, ELEC 861"],
        "phone": "613-533-6591",
        "degrees": "PhD, P.Eng",
        "professor_type": "Professor",
        "faculty": "Electrical and Computer Engineering",
        "email": "gazor@queensu.ca",
        "office": "Walter Light Hall, Room: 411",
        "expertise": ["Complex Sulphides", "Pyrrhotite Rejection"],
        "biography": "Dr. Saeed Gazor received the BSc degree in Electronics Engineering in 1987 and the MSc degree in Communication Systems Engineering in 1989, from Isfahan University of Technology, both with Summa Cum Laude, the highest honors. He received his PhD in Signal and Image Processing from Telecom Paris, Departement Signal (École Nationale Supérieure des Télécommunications /ENST, Paris), 1994, France. From 1995 to 1998, he was an Assistant Professor in Isfahan University of Technology, Department of Electrical and Computer Engineering. He was a research associate at University of Toronto from January 1999 to July 1999. Since 1999, he has been on the Faculty at Queen's University at Kingston, Ontario and currently holds the position of full Professor of the Department of Electrical and Computer Engineering. He is also cross-appointed to the Department of Mathematics and Statistics at Queen's University. He teaches courses and undertakes research related to signal processing. He served as Editor for IEEE Signal Processing Letters. Dr. Gazor is a senior member of the Institute of Electrical and Electronics Engineers (IEEE), Institution of Engineering and Technology (IET) and Professional Engineers Ontario." 
    },
    {
       "name": "Ryan Grant",
        "courses_teaching": ["ELEC 271"],
        "phone": "613-533-6000 ext. 74919",
        "degrees": "PhD",
        "professor_type": "Assistant Professor",
        "faculty": "Electrical and Computer Engineering",
        "email": "ryan.grant@queensu.ca",
        "office": "Walter Light Hall, Room: 610",
        "expertise": ["Cloud Computing", "High Performance Networks", "Network Systems Software", "Low-level Hardware-software Interfaces", "Message Passing", "High Performance Computing (HPC)", "Power/Energy Management of Extreme-scale System"],
        "biography": "Dr. Ryan Grant, a Queen’s researcher and leading expert in secure supercomputing and AI Exascale infrastructure, is a strong advocate for sovereign supercomputing in Canada. He believes that government investment would ensure that both industry and researchers have access to cutting-edge and affordable infrastructure while positioning Canada as a global leader in advancing medicine, AI, and climate science research. Dr. Ryan Grant is currently an assistant professor in the Department of Electrical and Computer Engineering. His research focuses on cloud computing, high performance networks, low-level hardware-software interfaces, message passing, high performance computing (HPC), and power management for Extreme-scale systems. He is also active in Queen’s Ingenuity Labs Research Institute and running the Computing at Extreme Scale Advanced Research (CAESAR), one of the largest supercomputing architecture labs in the world. Dr. Grant received his PhD in 2012 from Queen’s University. Prior to joining Queen’s Smith Engineering faculty in 2021, he worked at Sandia National Laboratories (SNL), a global leader in supercomputer design, in Albuquerque, USA. At SNL, he led the team that developed a software specification that is now integral to the networking hardware used in all the world’s most powerful supercomputers. Dr. Grant has published more than 80 peer-reviewed articles on system software. He has won numerous awards for his work including an “Oscars of Research” (R&D100 Award), several U.S. Defense Programs Awards, a Public Good Innovator Award, a Queen’s University 125th engineering alumni award, and best paper awards. Dr. Grant holds chairs with technical specifications councils in systems software for networking and hyperscale datacenter power management. He has also held chairs at several conferences and works as an associate editor or guest editor for journals like IEEE Micro and Transactions on Benchmarks, Standards and Evaluations. He serves on the steering committees for Hot Interconnects and ExaMPI. He is also a senior member of the IEEE and an ACM member. For more on Dr. Ryan Grant’s supercomputing research journey, see:\n* Sparking Canada’s supercomputing renaissance (Queen’s Gazette, September 2024)\n* Queen’s researcher Ryan Grant is the mind behind Canada’s supercomputing revolution (Queen’s Alumni Review, March 3, 2025)\n* Supercomputing and AI: The New Foundation for Engineering Plus Innovation (Smith Engineering News, November 1, 2024)" 
    },
    {
       "name": "Melissa Greeff",
        "courses_teaching": ["MREN 223"],
        "phone": "N/A",
        "degrees": "PhD",
        "professor_type": "Assistant Professor",
        "faculty": "Electrical and Computer Engineering",
        "email": "melissa.greeff@queensu.ca",
        "office": "N/A",
        "expertise": ["Robotics and Control Systems", "Vision-Based Navigation"],
        "biography": "Melissa Greeff is an Assistant Professor in the department of Electrical and Computer Engineering. She is a faculty affiliate with the Vector Institute for Artificial Intelligence. Her research interests include aerial robots, vision-based navigation, and safe learning-based control. She obtained her BASc in Engineering Science and her PhD from the University of Toronto. For more information about her research, visit the Robora Lab webpage." 
    },
    {
       "name": "Michael Greenspan",
        "courses_teaching": ["APSC 143, ELEC 279"],
        "phone": "613-533-6000 ext. 77736",
        "degrees": "PhD, P.Eng",
        "professor_type": "Professor",
        "faculty": "Electrical and Computer Engineering",
        "email": "michael.greenspan@queensu.ca",
        "office": "Walter Light Hall, Room: 515",
        "expertise": ["Computer Vision", "Image Processing"],
        "biography": "Michael Greenspan was awarded a BSc ('86, Physics and Applied Mathematics) from the University of Toronto, a BASc ('89, Electrical Engineering) and MASc ('91, Electrical Engineering} from the University of Ottawa, and a PhD ('91, Systems and Computer Engineering) from Carleton University, Ottawa. From 1991 to 2001, Dr. Greenspan worked at the Institute for Information Technology of the National Research Council of Canada, as a researcher and ultimately as the leader of the Computational Video Group. He is currently a Professor with the Department of Electrical and Computer Engineering at Queen's University. Michael has published over 30 technical papers and holds 3 patents. He has worked with industry on a number of collaborative projects. Michael is a member of the IEEE Computer Society, and holds an appointment on the Research Management Committee of Precarn Associates, Inc. For more info on Dr. Greenspan's visit RCV lab webpage" 
    },
    {
       "name": "Mariam Guizani",
        "courses_teaching": ["ELEC 376"],
        "phone": "613-533-6000 ext. 77297",
        "degrees": "PhD",
        "professor_type": "Assistant Professor",
        "faculty": "Electrical and Computer Engineering",
        "email": "mariam.guizani@queensu.ca",
        "office": "Walter Light Hall, Room: 403",
        "expertise": ["Software Engineering", "Open-Source Software", "Diversity and Inclusion", "Human-Computer Interaction"],
        "biography": "Dr. Mariam Guizani is an Assistant Professor in the Department of Electrical and Computer Engineering at Queen’s University.  She holds a PhD and second MSc from Oregon State University and was a Fulbright fellowship recipient. Additionally, she holds a BSc and a MSc degree in software engineering. At the intersection of Software Engineering and Human-Computer Interaction, her research centers around improving the state of Diversity and Inclusion in complex socio-technical ecosystems such as Open Source. More specifically, her research focuses on designing processes and tools to help Open-Source Software (OSS) communities make their projects more inclusive and attract and retain contributors.  The broader impact of her work applies to academia, industry, and large OSS organizations. Dr. Mariam Guizani has worked together with Google and the Apache Software Foundation (ASF) for several years to understand communities’ experiences and needs. Her research at Microsoft Research was recognized by GitHub for its contribution to the currently deployed GitHub Discussion Dashboard, GitHub Blocks, and their future roadmap. Dr. Mariam Guizani has also collaborated with Foundations and departments such as Wikimedia, and Oregon State University IT department to empower communities to dismantle cognitive barriers in software. Her research has been published at both ACM and IEEE conferences including Conference on Computer Supported Cooperative Work (CSCW), International Conference on Software Engineering (ICSE) and Transactions on Software Engineering (TSE). Dr. Mariam Guizani has been invited to present her work at both Academic and Industry venues including ICSE, CSCW, Google, GitHub, ApacheCon , and the Linux Foundation Open-Source Summit." 
    },
    {
       "name": "Keyvan Hashtrudi-Zaad",
        "courses_teaching": ["ELEC 221, MREN 348, ELEC 443, ELEC 444, ELEC 448, ELEC 848"],
        "phone": "613-533-2991",
        "degrees": "PhD, P.Eng",
        "professor_type": "Professor",
        "faculty": "Electrical and Computer Engineering",
        "email": "khz@queensu.ca",
        "office": "Walter Light Hall, Room: 427",
        "expertise": ["Robotics, Control Systems"],
        "biography": "Keyvan Hashtrudi-Zaad received the Ph.D. degree in electrical and computer engineering from the University of British Columbia, Canada, in 2000. He then held a consulting position with Motion Metrics International Corp., Vancouver on the development of a dynamic payload monitoring system for heavy-duty hydraulic machines. In 2001, he joined the Department of Electrical and Computer Engineering, Queen’s University, Canada, where he is currently a Professor and the Director of Interactive Robotics and Intelligent Systems (IRIS) Laboratory. Dr. Hashtrudi-Zaad’s research interests include applications of control and intelligent systems in haptics and telerobotics, rehabilitation robotics, and autonomous driving. His research in the control of telerobotic systems is considered as seminal work in the field. Dr. Hashtrudi-Zaad is currently an Associate Editor for IEEE Robotics and Automation Letters (RA-L) and the Co-Chair of the IEEE RAS Technical Committee for Telerobotics (TCT). He has also served as an Associate Editor of IEEE Transactions on Haptics, the General Co-Chair of 2021 IEEE World Haptics Conference (WHC 2021), the Chair of IEEE WHC Steering Committee and the Associate Editor of WHC 2011-19, WHC-2023-25, and Eurohaptics 2022. Dr. Hashtrudi-Zaad is the Undergraduate Program Chair of the Mechatronics and Robotics Engineering program at Smith Engineering and a Professional Engineer in the province of Ontario." 
    },
    {
       "name": "Shideh Kabiri Ameri",
        "courses_teaching": ["ELEC 252, ELEC 344"],
        "phone": "613-533-6000 ext. 79215",
        "degrees": "PhD",
        "professor_type": "Assistant Professor",
        "faculty": "Electrical and Computer Engineering",
        "email": "shideh.ameri@queensu.ca",
        "office": "Walter Light Hall, Room: 412",
        "expertise": ["Wearables", "2D material based electronic devices", "Bioelectronics", "IoTs"],
        "biography": "Dr. Shideh Kabiri Ameri is an Assistant Professor in the Department of Electrical and Computer Engineering, Queen’s University. Dr. Ameri received her PhD in Electrical Engineering in 2015 from the Tufts University, Medford, MA. She was a Postdoctoral Research Fellow and Research Associate in the ECE Department at the University of Texas at Austin from 2015 to 2018, prior to joining to the ECE Department at the Queens’s University in September 2018. Dr. Ameri also holds a master and bachelor degrees in Physics (solid state) and AS degree in Medical Laboratory Sciences. Her research is mainly focused on 2D material based electronic devices and their applications in wearables, bioelectronics, human machine interface (HMI), internet of things (IoTs) and mobile health care. Dr. Ameri was the recipient of the “Rising Star in EECE 2017” award and to date her research has led to more than 40 journal article publications, conference presentations and invited talks. Dr. Ameri’s research was highlighted worldwide by various media including BBC, IEEE Spectrum, Phys.Org, International Business Times UK, Graphene National Association, The Indian Express and Sohu.com (搜狐). " 
    },
    {
       "name": "Sean Kauffman",
        "courses_teaching": ["APSC 142"],
        "phone": "613-533-6000 ext. 77360",
        "degrees": "PhD",
        "professor_type": "Assistant Professor",
        "faculty": "Electrical and Computer Engineering",
        "email": "sean.k@queensu.ca",
        "office": "Walter Light Hall, Room: 611",
        "expertise": ["Formal methods", "Real-time Systems", "Software Engineering"],
        "biography": "Sean Kauffman is an Assistant Professor in the Department of Electrical and Computer Engineering at Queen’s University.  Before coming to Queen’s, Sean obtained his Ph.D. in Electrical and Computer Engineering at the University of Waterloo and spent two years as a Postdoctoral Researcher at Aalborg University in Denmark. Sean came back to academia after spending more than ten years working in industry as a software engineer, where his last position was a principal software engineer for Oracle. Sean's research focuses on safety-critical software and fits into the broad themes of Formal Methods, Runtime Verification, Anomaly Detection, and Explainable AI.  He has collaborated on research with partners such as NASA's Jet Propulsion Laboratory, the Embedded Systems Institute, QNX, and Pratt and Whitney Canada.  Sean's teaching philosophy focuses on fostering engagement, using techniques like active learning, productive failure, and peer instruction." 
    },
    {
       "name": "Il-Min Kim",
        "courses_teaching": ["ELEC 490"],
        "phone": "613-533-6000 ext. 77672",
        "degrees": "PhD, P.Eng",
        "professor_type": "Professor, Chair of Undergraduate Studies for Electrical Engineering",
        "faculty": "Electrical and Computer Engineering",
        "email": "ilmin.kim@queensu.ca",
        "office": "Walter Light Hall, Room: 422",
        "expertise": ["Deep Learning", "AI", "Communications", "Signal Processing"],
        "biography": "Il-Min Kim received his B.S. degree in Electronics Engineering from Yonsei University, Seoul, Korea, in 1996, and his M.S. and Ph.D. degrees in Electrical Engineering from the Korea Advanced Institute of Science and Technology (KAIST), Taejon, Korea, in 1998 and 2001, respectively. From July 1997 to August 2001, he worked as a Part-Time Engineer at the Electronics and Telecommunications Research Institute (ETRI). He then worked as a Postdoctoral Research Fellow in the Department of Electrical Engineering and Computer Sciences (EECS) at the Massachusetts Institute of Technology (MIT) from October 2001 to August 2002 and in the Department of Electrical Engineering at Harvard University from September 2002 to June 2003. In July 2003, he joined the Department of Electrical and Computer Engineering (ECE) at Queen’s University, Kingston, Canada, as an Assistant Professor. He was promoted to Associate Professor in 2009 and Full Professor in 2014. He has served as Chair of the Undergraduate Program (Electrical Engineering) since July 2022 and was Chair of the Graduate Program (Graduate Coordinator) from July 2012 to June 2015. He is currently Director of Ubiquitous Artificial Intelligence Laboratory (UAI lab), a core faculty member of Ingenuity Labs Research Institute, and a faculty member of Queen's Centre for Security & Privacy. He is also cross-appointed as an Adjunct Professor in the School of Electrical Engineering and Computer Science (EECS) at the University of Ottawa. His research focuses on artificial intelligence (AI), including ubiquitous AI, edge AI, on-device AI, safe AI, universal equity AI, AI governance, AI alignment with human values, foundation models, machine unlearning, data privacy in machine learning, federated learning, distributed learning, continual learning, diffusion models, out-of-distribution (OOD) detection, self-supervised learning, contrastive representation learning, AI for IoT/IoE/IIoT/Mobile Crowd Sensing (MCS), AI-driven 6G wireless systems, AI-driven vehicle-to-everything (V2X) communications, and Geoscience AI (Geo-AI). He holds multiple patents, either issued or pending, in the U.S., Japan, Germany, and Korea. His awards include First Prize in the Dense Video Captioning Challenge at the CVsports Workshop of CVPR 2024, the President’s Award from the Korean Federation of Science and Technology Societies (KOFST) in 2021, Best Paper Award at UBICOMM 2014, the Best Young Alumnus Award from KAIST in 2004, the Gold Prize in the 2001 Samsung International Paper Contest, and the Bronze Prize in the 1999 IEEE-Korea Section Paper Contest. At Queen’s University, he has received seven ECE Best Professor Awards (2025, 2024, 2016, 2011, 2008, 2006, and 2005). He has served as an Editor for IEEE Transactions on Wireless Communications, IEEE Wireless Communications Letters, and the Journal of Communications and Networks (JCN). He is a Senior Member of IEEE and a registered Professional Engineer with Professional Engineers Ontario (PEO). In 2008, he served as Vice-Chair, Programme, for the IEEE Kingston Section." 
    },
    {
       "name": "Yan-Fei Liu",
        "courses_teaching": ["ELEC 431, ELEC 490, ELEC 498, ELEC 832"],
        "phone": "613-533-6731",
        "degrees": "PhD, P.Eng",
        "professor_type": "Professor, Chair of Graduate Studies",
        "faculty": "Electrical and Computer Engineering",
        "email": "yanfei.liu@queensu.ca",
        "office": "Walter Light Hall, Room: 421",
        "expertise": ["Power Electronics"],
        "biography": "Dr. Liu (Fellow of IEEE, 2013, Fellow of CAE, 2018) received his Bachelor and Master degree from the Department of Electrical Engineering from Zhejiang University, China, in 1984 and 1987, and PhD degree from the Department of Electrical and Computer Engineering, Queen’s University, Kingston, ON, Canada, in 1994. He was a Technical Advisor with the Advanced Power System Division, Nortel Networks, in Ottawa, Canada from 1994 to 1999. Since 1999, he has been with Queen’s University, where he is currently a Professor with the Department of Electrical and Computer Engineering. His current research interests are listed as following: \n* How to best utilize the benefits of GaN and SiC devices to explore the full advantage of these devices so that small size and high-efficiency power converters can be designed. \n* Extremely high efficiency (>99%)  and extremely high power density (>2000W / inch 3 ) DC-DC Bus converter for data center application \n* High power density LLC resonant converter for different power levels (from 65W to 4000W) for different applications (such as PD adapter, data center power, EV on-board DC-DC converter)  \n* Digital Control technologies for accurate current sharing of multi-phase interleaved LLC resonant converter to achieve high efficiency and high power density simultaneously. \n* Digital control technology for fast dynamic response of DC-DC converters. \n* High efficiency, high power density AC to DC power converter for USB C Power Delivery (PD) application using GaN switches. \n* On-board EV DC-DC converter with high efficiency and high power density using GaN switches. \n* High power, high efficiency, and high power density single-phase AC–DC rectifier suitable for On-Board Chargers using GaN switches. \n He has authored around 300 technical papers in the IEEE Transactions and conferences ( View Dr. Liu’s Publications ), and holds 75 U.S. patents ( View Dr. Liu’s Patents ). He has written a book on “High Frequency MOSFET Gate Drivers: Technologies and Applications”, published by IET. He is also a Principal Contributor for two IEEE standards. He received “Modeling and Control Achievement Award” from IEEE Power Electronics Society in 2017. He received Premier’s Research Excellence Award in 2000 in Ontario, Canada. He also received the Award of Excellence in Technology in Nortel in 1997.\n Dr. Liu is the Vice President of Technical Operations of IEEE Power Electronics Society (PELS, from 2017 to 2020, https://www.ieee-pels.org/technical-activities ). He is the general chair of ECCE 2019 to be held in Baltimore, USA in 2019, http://www.ieee-ecce.org/2019/ ). Dr. Liu serves as an Editor of IEEE Journal of Emerging and Selected Topics of Power Electronics (IEEE JESTPE) since 2013. His other major service to IEEE is listed below: a Guest Editor-in-Chief for the special issue of Power Supply on Chip of IEEE Transactions on Power Electronics from 2011 to 2013; a Guest Editor for special issues of JESTPE: Miniaturization of Power Electronics Systems in 2014 and Green Power Supplies in 2016; as Co-General Chair of ECCE 2015 held in Montreal, Canada, in September 2015; the chair of PELS Technical Committee (TC1) on Control and Modeling Core Technologies from 2013 to 2016; chair of PELS Technical Committee (TC2) on Power Conversion Systems and Components from 2009 to 2012.  " 
    },
    {
       "name": "Ying Zou",
        "courses_teaching": ["ELEC 278, SOFT 437, ELEC 876"],
        "phone": "613-533-6497",
        "degrees": "PhD, P.Eng",
        "professor_type": "Professor, Canada Research Chair Tier 1",
        "faculty": "Electrical and Computer Engineering",
        "email": "ying.zou@queensu.ca",
        "office": "Goodwin Hall, Room: 731",
        "expertise": ["Software Engineering"],
        "biography": "Dr. Ying Zou is a Canada Research Chair (Tier I) in Software Evolution. She is a professor in the Department of Electrical and Computer Engineering and cross-appointed to the School of Computing at Queen’s University in Canada. She is a visiting scientist of IBM Centers for Advanced Studies (CAS), IBM Canada. She was awarded with 2014 IBM CAS Research Faculty Fellow of the Year. Dr. Zou also won twice IBM Faculty Awards in 2007 and 2008. The 2008 IBM Faculty award was selected to grant top amounts from IBM worldwide program. The candidates must have an outstanding reputation for contributions in their field or, in the case of junior faculty, show unusual promise. Her research interests include software engineering, software maintenance and evolution, empirical studies, software analytics and service-oriented computing. \n Dr. Ying Zou received her BEng from Beijing Polytechnic University, Meng from Chinese Academy of Space Technology, and PhD from University of Waterloo. Currently, she is a Professor & Canada Research Chair (Tier I) in the Department of Electrical & Computer Engineering at Queen's University. She is a visiting faculty fellow of IBM Centers for Advanced Studies (CAS). Dr. Zou is cross-appointed in the School of Computing at Queen's University. She is also a senior member of IEEE and IEEE Computer Society." 
    },
    {
       "name": "Xiaodan Zhu",
        "courses_teaching": ["ELEC 425, ELEC 279, ELEC 825, ELEC 880"],
        "phone": "613-533-6000 ext. 79286",
        "degrees": "PhD",
        "professor_type": "Associate Professor",
        "faculty": "Electrical and Computer Engineering",
        "email": "xiaodan.zhu@queensu.ca",
        "office": "Mitchell Hall, Room: 245 E",
        "expertise": ["Deep Learning", "Artificial Intelligence", "Natural Language Processing", "Machine Learning"],
        "biography": "Dr. Xiaodan Zhu is an Associate Professor of the Department of Electrical and Computer Engineering. He leads the Text Analytics and Machine Learning Lab (TAML). Dr. Zhu received his Ph.D. from the Department of Computer Science at the University of Toronto in 2010 and his Masters of Engineering from the Department of Computer Science and Technology at Tsinghua University in 2000. He was a researcher of National Research Council Canada from 2010 to 2017.\nDr. Zhu and his students published at top machine learning, natural language processing, and artificial intelligence conferences and journals such as ICML, ACL, IJCAI, JAIR, IEEE/ACM TASLP, JASIST, JAMIA, NAACL, EACL, IPM, etc. His recent work has received the Adam Kilgarriff *SEM Best Paper Award for Lexical Semantics.\nRecently he serves as a Chair for The 33rd Canadian Conference on Artificial Intelligence. He serves for ACL '19 Best Paper Award Committee. He has been as an Associate Editor for the Computational Intelligence journal since 2015. Dr. Zhu is Co-Chair for SemEval '20, '19; Publication Chair for COLING '18; Area Chair for ACL '19, '18, EMNLP '19, NAACL '19, and COLING '18; Workshop Chair for COLING '20. He is an active reviewer for NIPS, AAAI, AISTATS, IJCAI, ACL, TKDE, EMNLP, ICASSP, TASLP, COLING, JBI, ICASSP, INTERSPEECH, ect.\nDr. Zhu was an Evaluation Group Member of NSERC Discovery Grants (Computer Science Group, 2017), Canada. He also served as an external reviewer for government grants such as Discovery Grants, Industrial Research & Development Fellowship, Research Support for New Academics (Québec), General Research Fund (Hong Kong), and Faculty Development Scheme (Hong Kong). He also helped review startup companies' proposals (e.g., for CDL of University of Toronto). \nIn the past, Dr. Zhu has worked with industrial research labs either as a research intern (Google (New York), IBM T.J. Watson Research Center), a visiting scholar (Microsoft Research Asia), or as a full-time researcher (Intel's China Research Center)." 
    },
    {
       "name": "Shahram Yousefi",
        "courses_teaching": ["APSC 100, APSC 381, ELEC 221, ELEC 326, ELEC 390, ELEC 461, ELEC 490, ELEC 865"],
        "phone": "613-533-6000 ext. 32936",
        "degrees": "PhD, P.Eng",
        "professor_type": "Professor",
        "faculty": "Electrical and Computer Engineering",
        "email": "s.yousefi@queensu.ca",
        "office": "Walter Light Hall, Room: 601",
        "expertise": ["Algorithms", "Communication Systems and Networks", "AI-ML for healthcare-human resource efficiency"],
        "biography": "Dr. Shahram Sean Yousefi considers harmony the ultimate goal of any activity and his mission in life is to help as many people as possible to enjoy theirs while reaching full personal potential. Shahram’s current focus is solving problems at the intersection of technology, academia, and healthcare. Be it the next approach towards training highly-qualified personnel or tackling human resource challenges in hospitals, Shahram’s philosophy is that communication and compassion are the key ingredients to achieve beyond win-win solutions. \nShahram has 25 years of experience in engineering, technology, teaching, managing teams and projects, as well as public speaking and advising over 3 continents (visiting 85 countries). He received his B.Sc. in electrical engineering from the University of Tehran and his Ph.D. in telecom from the University of Waterloo in Canada. He has held positions at the University of Toronto, Canada, Ecole Polytechnique Fédéral de Lausanne (EPFL), Switzerland, Jilin University, China, University of California, Santa Cruz, USA, and Queen's University, Kingston, Canada, where he is currently a tenured full professor and has served as an acting Department Head (ECE) and Associate Dean (Engineering). \nShahram was elected as the Editor-in-Chief of the IEEE CJECE journal (2016-2020) and as an editor/reviewer for a large number of peer-reviewed journals. He has received more than 20 awards and scholarships including the Golden Apple teaching award as well as the Natural Sciences and Engineering Research Council of Canada’s Discovery Accelerator Supplement (NSERC DAS) award. " 
    },
    {
       "name": "Scott Yam",
        "courses_teaching": ["ELEC 381, ELEC 864"],
        "phone": "613-533-6000 ext. 75235",
        "degrees": "PhD",
        "professor_type": "Professor, Associate Department Head",
        "faculty": "Electrical and Computer Engineering",
        "email": "scott.yam@queensu.ca",
        "office": "Walter Light Hall, Room: 420",
        "expertise": ["Optical fiber systems and sub-systems for Communication and Sensing", "Sensor integration for industrial and health applications"],
        "biography": "Dr. Scott Yam is currently a Professor in the Department of Electrical and Computer Engineering at Queen's University, Canada. He received the BEng degree in Electrical and Computer Engineering from the University of Waterloo in Canada (1998), and the MASc and PhD degrees in Electrical Engineering from Stanford University (2000, 2004) in the USA. From 2000 to 2003, he worked as a Sprint Fellow at the Sprint Advanced Technology Laboratories (ATL) in Burlingame, California. He is a member of the Institute of Electrical and Electronics Engineers (IEEE), the IEEE Photonics Society, the IEEE Communications Society, and the Optica (formerly the Optical Society of America).\nDr. Yam has over 100 technical journal and conference publications, as well as 2 patents and 1 pending patent application. He has also served as reviewer for Photonics Technologies Letters, Optics Letters, and Journal of Lightwave Technologies, and is a recipient of the Young Scientist Award and Student Paper Award from the IEEE LEOS (currently Photonics Society) Japan Chapter." 
    },
    {
       "name": "Carlos Saavedra",
        "courses_teaching": ["ELEC 353, ELEC 381, ELEC 457, ELEC 490, ELEC 854"],
        "phone": "613-533-2807",
        "degrees": "PhD, P.Eng",
        "professor_type": "Professor, Department Head",
        "faculty": "Electrical and Computer Engineering",
        "email": "saavedra@queensu.ca",
        "office": "Walter Light Hall, Room: 419 & 518",
        "expertise": ["Antennas", "Millimeter-Waves", "RF Circuits"],
        "biography": "Prof. Carlos Saavedra received the BASc degree from the University of Virginia in 1993 and the PhD degree from Cornell University, Ithaca, NY, in 1998. From 1998 to 2000 he was a Senior Engineer at Millitech Corporation, Northampton, Massachusetts, where he was lead designer for 38 GHz point-to-point broadband wireless transceivers. In 2000 he joined the Department of Electrical and Computer Engineering at Queen's University at Kingston where he currently holds the rank of Full Professor. He served as ECE Graduate Chair from 2007 to 2010. While on Sabbatical leaves, he has held visiting appointments at the University of Navarra, Spain, the Universidade Federal of Rio Grande do Sul, Brazil, and the University of Twente, Holland. \nProf. Saavedra is former Co-Chair of the Natural Sciences and Engineering Research Council of Canada (NSERC) Discovery Grant Evaluation Group for Electrical and Computer Engineering and he has served on grant review panels at the National Science Foundation (USA) and as external reviewer for the Netherlands Organisation for Scientific Research. He is a prior recipient of an NSERC Discovery Accelerator Award, he co-authored/supervised the Best Student Paper at the 2009 IEEE SiRF Conference and he is a three-time recipient of the ECE undergraduate teaching award. He is a former Associate Editor of the IEEE Transactions on Microwave Theory and Techniques, Guest Editor of the IEEE Microwave Magazine, Technical Program Committee Member of the IEEE International Microwave Symposium, the IEEE RFIC Symposium and the IEEE NEWCAS Conference." 
    },
    {
       "name": "Karen Rudie",
        "courses_teaching": ["ELEC 270, ELEC 843"],
        "phone": "613-533-2966",
        "degrees": "PhD, P.Eng",
        "professor_type": "Professor, Director (Interim)",
        "faculty": "Electrical and Computer Engineering",
        "email": "karen.rudie@queensu.ca",
        "office": "Walter Light Hall, Room: 409",
        "expertise": ["Supervisory Control of Discrete-event Systems"],
        "biography": "Karen Rudie received her PhD in 1992 from the University of Toronto in the Systems Control Group of the Department of Electrical Engineering, under the supervision of W.M. Wonham. From 1992-93, she worked for one year as a postdoctoral researcher at the Institute for Mathematics and iIts Applications in Minnesota. Since 1993 she has been with the Department of Electrical and Computer Engineering at Queen's where she is currently a Professor. Since 1995 she has been cross-appointed to the School of Computing.  In 1999-2000 she was a visiting professor in the Department of Electrical Engineering and Computer Science at the University of Michigan. \nSince 2000 she has been on the editorial board of the Journal of Discrete Event Dynamic Systems: Theory and Applications where she is now a Department Editor. She has served as an Associate Editor for IEEE Transactions on Control Systems Technology (2015-2020),  IEEE Transactions on Automatic Control (1996-1999) and  IEEE Control Systems Magazine (2003). From 2001-2003 she was a member of the Board of Governors of the IEEE Control Systems Society. She has also served on the Technical Program Committees of the IEEE Conference on Decision and Control (CDC), (2018, 2016, 2014, 2011, 2008, 2003, 2001, 2000) the American Control Conference (ACC) (2008, 1999), the International Workshop on Discrete Event Systems (WODES) (2018, 2016, 2010, 2006) and the IEEE International Conference on Emerging Technologies and Factory Automation (2013, 2012),   the Discrete Event and Hybrid Systems Program Subcommittee, IFAC World Congress (2005) and the IFAC Workshop on Discrete-Event Systems (2004). \nKaren has been a semi-plenary speaker at the IEEE Conference on Decision and Control (2021) and an IEEE Distinguished Lecturer (2004-2006). She is a recipient of the following teaching awards: three Queen's Golden Apple Awards in Engineeering and Applied Science, in 2021, 2002 and 1998; and awards from the Department of Electrical and Computer Engineering, in 2018, 2017, 2016, 2015 and 1998 for 4th year courses and in 2019, 2018, 2017, 2016, 2014, 2013, 2012 and 2001 for 2nd year courses. She was listed for five years in the Maclean's Guide to Canadian Universities in their list of Popular Profs at Queen's University (2001, 2002, 2003, 2004, and 2005). She is a Fellow of the IEEE and a registered Professional Engineer with Professional Engineers Ontario. " 
    },
    {
       "name": "Matthew Pan",
        "courses_teaching": ["MREN 178, ELEC 390, ELEC 870"],
        "phone": "613-533-6000 ext. 79568",
        "degrees": "PhD",
        "professor_type": "Assistant Professor",
        "faculty": "Electrical and Computer Engineering",
        "email": "matthew.pan@queensu.ca",
        "office": "Walter Light Hall, Room: 702",
        "expertise": ["Human-Robot Interaction"],
        "biography": "Matthew Pan is a faculty member of the Department of Electrical and Computer Engineering (ECE) at Queen's University and a core member of the Ingenuity Labs Research Institute. His research areas include human-robot interaction, haptics, virtual/augmented reality and human augmentative technologies. At Queen's, he leads the Machine Intelligence and Human-Robot Interaction Laboratory (MItHRIL).\nPreviously, Dr. Pan was at Disney Research Los Angeles, where he worked on animatronic technologies and guest-facing interactive experiences designed for Walt Disney Imagineering and Disney Parks, Experiences, and Products. There, he led projects involving social and physical human-robot interaction as well as mixed reality technologies.\nDr. Pan obtained his MASc and PhD degrees in Mechanical Engineering at the University of British Columbia in Vancouver, Canada. He received his BASc in Mechatronics Engineering from the University of Waterloo in Waterloo, Canada. His prior research areas include the study of haptic displays, affective and psychophysiological computing, assistive robotics, and human-computer interaction.\nFor more information about Dr. Pan and his research, visit the MItHRIL webpage." 
    },
    {
       "name": "Majid Pahlevani",
        "courses_teaching": ["ELEC 252"],
        "phone": "613-533-6000 ext. 77473",
        "degrees": "PhD, P.Eng",
        "professor_type": "Associate Professor",
        "faculty": "Electrical and Computer Engineering",
        "email": "majid.pahlevani@queensu.ca",
        "office": "Walter Light Hall, Room: 608",
        "expertise": ["Energy Systems"],
        "biography": "Dr. Pahlevani received his PhD degree from Queens University, Kingston, ON, Canada, in 2012. He is currently an Assistant Professor with the Department of Electrical and Computer Engineering, Queen’s University. Prior to Queen’s, he was an Assistant Professor at the University of Calgary, Calgary, AB, Canada, from 2016 to 2019. He was also the Chief R&D Engineer and then the VP of Technology with SPARQ Systems, Inc., from 2011 to 2016. At SPARQ, he invented multiple innovative power circuitry and digital control techniques for SPARQ’s main product, QUAD micro-inverter. He collaborated with Freescale Semiconductor, Inc., where he was the Leader of a research team working on the design and implementation of the power converters for a pure electric vehicle from 2008 to 2011. He has conducted more than 20 industrial projects in renewable energy systems, energy storage systems, electric vehicles, and LED lighting. He has authored more than 130 journal and conference proceeding papers and is the holder of 50 U.S. patents (issued/pending). \nDr. Pahlevani is the Associate Editor of the IEEE Journal of Emerging and Selected Topics in Power Electronics and a Member of the IEEE Power Electronics Society. He is also the recipient of numerous awards such as the “Early Research Excellence” Award form Alberta, Canada, “Research Achievement Award” and “Teaching Achievement Award” from the University of Calgary, “Engineering and Applied Sciences Outstanding Thesis” Award from Queens University, Kingston, ON, Canada, “Research Excellence Award” from IEEE Canada, and “Distinguished Research Award” from the University of Calgary." 
    },
    {
       "name": "Jianbing Ni",
        "courses_teaching": ["ELEC 887"],
        "phone": "613-533-6000 ext. 79428",
        "degrees": "PhD",
        "professor_type": "Assistant Professor; Chair of Undergraduate Studies for Computer Engineering",
        "faculty": "Electrical and Computer Engineering",
        "email": "jianbing.ni@queensu.ca",
        "office": "Walter Light Hall, Room: 424",
        "expertise": ["Cyber Security"],
        "biography": "Dr. Jianbing Ni is currently an assistant professor in the Department of Electrical and Computer Engineering at Queen's University, Canada, and the Tier-2 Canada Research Chair in Intelligent System Security and Privacy. He received the PhD degree in Electrical and Computing Engineering at the University of Waterloo under the supervision of Prof. Sherman Shen and Prof. Xiaodong Lin,  in 2018. His research interests include mobile network security, trustworthy artificial intelligence, cloud/edge computing security, and blockchain technology. He has published over 120 papers in IEEE Transactions and highly selected conferences. He has received 9 best paper awards from international conferences, including IEEE Communications Society's flagship conferences (IEEE GLOBECOM and IEEE ICC) and security conference (SECURECOMM). He also received the Best Paper Award for IEEE Transactions on Mobile Computing in 2022, the IEEE Vehicular Technology Society Early Career Award in 2022, the IEEE Technical Committee on Scalable Computing Award for Excellence in Scalable Computing (Early Career Researchers) in 2023, the IEEE ComSoc Communications & Information Security Technical Committee (CISTC) 2024 Early Career Award. \nDr. Ni has demonstrated his leadership through engagement in prominent positions in major international conferences, including Symposium Chair for IEEE ICC 2024, Track Chair for IEEE CCECE 2024, ICNC 2024, PST 2024, PST 2025, General Chair for FCS 2023, and Program Vice-chair for CSE 2022. He is serving as an associate editor for 3 prestigious journals, including IEEE Transactions on Information Forensics and Security (TIFS) and IEEE Systems Journal. In addition, Dr. Ni is serving as the co-chair of the IEEE Blockchain Canada Chapter in IEEE Technology and Engineering Management Society. \nPositions are available for postdocs, PhD, and Masters, in areas in security, privacy, artificial intelligence, and blockchain. If you are interested in applying for a position, please contact me (jianbing.ni@queensu.ca)" 
    },
    {
       "name": "Nasim Montazeri",
        "courses_teaching": ["ELEC 408"],
        "phone": "613-533-6000 ext. 77177",
        "degrees": "PhD",
        "professor_type": "Assistant Professor",
        "faculty": "Electrical and Computer Engineering",
        "email": "nasim.montazeri@queensu.ca",
        "office": "Walter Light Hall, Room: 607",
        "expertise": ["Smart textiles", "Biomedical Signal Processing", "Acoustics", "Wearables"],
        "biography": "Dr. Nasim Montazeri is an Assistant Professor in the Department of Electrical and Computer Engineering. Before joining Queen's, she was a postdoctoral fellow at the Sunnybrook Research Institute and University Health Network. She received a double PhD degree in signal processing and biomedical engineering from the University of Rennes 1 in France and Sharif University of Technology in Iran. Dr. Montazeri holds BSc degrees in biomedical and control engineering and a MSc degree in biomedical engineering. Dr. Montazeri was a woman entrepreneur and the co-founder of the BioSenseTex, a start-up company with expertise in developing innovative medical textile-based wearables. Dr. Montazeri was the recipient of several entrepreneurship awards, such as Borealis AI/RBC for her innovative research on analyzing respiratory system using acoustics and the Entrepreneurship for Cardiovascular Health Opportunities, ECHO award for developing a textile-based sensor to measure lung edema in heart failure. To date her research has led to more than 40 journal article publications, conference presentations, abstracts and invited talks in major scientific venues such as American Thoracic Society (ATS), European Respiratory Society (ERS), World Sleep Congress, IEEE-EMBS, IEEE-ISSPIT, and Canadian Consortium on Neurodegeneration in Aging (CCNA). Her research interests include the development of medical wearables that promote remote health monitoring, the analysis of health data, and the use of artificial intelligence in healthcare—more specifically in sleep. " 
    },
    {
       "name": "Joshua Marshall",
        "courses_teaching": ["MREN 403, ELEC 845"],
        "phone": "613-533-2921",
        "degrees": "PhD, P.Eng",
        "professor_type": "Professor",
        "faculty": "Electrical and Computer Engineering",
        "email": "joshua.marshall@queensu.ca",
        "office": "Walter Light Hall, Room: 413",
        "expertise": ["Field and Mobile Robotics", "Control Systems Engineering"],
        "biography": "Joshua Marshall, PhD, PEng, SMIEEE, was born in Iqaluit (ᐃᖃᓗᐃᑦ) and was raised in St. Lucia (Caribbean), Edmonton (Alberta), Winnipeg (Manitoba), and North Bay (Ontario). Dr. Marshall is a robotics engineer, educator, and consultant with expertise in data-driven control systems engineering, mobile robotics, autonomous vehicle navigation and mapping.  He has a special interest in and experience with autonomous robot applications in mining, space, marine, and defence, as well as in other harsh-environment applications.\n Dr. Marshall earned his doctoral degree in electrical and computer engineering, specializing in systems control, from the University of Toronto in 2005 under the supervision of Profs. Bruce Francis and Mireille Broucke.  He joined Queen’s University in 2010 where he started the multidisciplinary Offroad Robotics research group and, most recently, lead the collaborative robotics and artificial intelligence-focused Ingenuity Labs Research Institute as its founding Director (2018-24).  At Queen’s, Dr. Marshall is also cross-appointed to the Department of Mechanical & Materials Engineering and to The Robert M. Buchan Department of Mining where he supervises graduate research.  He has served as a departmental Graduate Admissions Coordinator (2019-23) and as Associate Head of department (2017-19, 2025-present).\nDr. Marshall was also a founding member of the NSERC Canadian Robotics Network (2011-24). In 2016-17, he was the KKS International Visiting Professor of Computer Science at the Centre for Applied Autonomous Sensor Systems (AASS) in the School of Science and Technology at Örebro University, Sweden. Prior to joining Queen’s, Dr. Marshall was an Assistant Professor in the Department of Mechanical & Aerospace Engineering at Carleton University where he founded the Robotic Vehicles Group. Before that, he served as an R&D/Control Systems Engineer on both space and terrestrial robotics projects at the firm MacDonald, Dettwiler, and Associates (MDA), Inc., where he worked on advanced field and mobile robotics projects for industry clients in Canada, the US, Australia, and Scandinavia. \nDr. Marshall is a Senior Member of the IEEE.  He served as a Technical Editor for the IEEE/ASME Transactions on Mechatronics (2019-22) and currently serves as an Associate Editor for dataset papers at the International Journal of Robotics Research (IJRR).  He was an elected Associate Editor from 2017-20 to the Conference Editorial Board (CEB) of the IEEE Control Systems Society (CSS) and as an Editor for the IEEE/RSJ International Conference on Robots and Systems (IROS) from 2017-21. He served on three occasions as co-organizer of the Control and Robotics Symposium of the IEEE Canadian Conference on Electrical and Computer Engineering (CCECE) and, from 2018-20, as a member of the IEEE Medal for Environmental & Safety Technologies Committee. \nDr. Marshall’s R&D work is featured in the From Earth to Us exhibit at the Canada Science and Technology Museum and has been commercialized through companies such as Epiroc (formerly Atlas Copco), Peck Tech Consulting (acquired by Caterpillar) and spin-off RockMass Technologies (now GroundedAI). He is the winner of the 2025 OPEA Engineering Medal — Research and Development from the Ontario Society of Professional Engineers (OSPE) for exceptional achievements in research, technological development, and the successful commercialization of engineering innovations.  Dr. Marshall is a licensed Professional Engineer in the province of Ontario and has served as an invited Program Visitor and Vice-Chair on multiple engineering program accreditation site visits across Canada for the Canadian Engineering Accreditation Board (CEAB) of Engineers Canada. \nJosh and his wife Jill live in the beautiful City of Kingston where they are the proud parents of Owen, Maeve, and Finn." 
    },
    {
       "name": "Ning Lu",
        "courses_teaching": ["ELEC 373"],
        "phone": "613-533-6000 ext. 79419",
        "degrees": "PhD",
        "professor_type": "Associate Professor; Canada Research Chair (Tier 2)",
        "faculty": "Electrical and Computer Engineering",
        "email": "ning.lu@queensu.ca",
        "office": "Walter Light Hall, Room: 401",
        "expertise": ["Communication Networks"],
        "biography": "Dr. Ning Lu is an Associate Professor in the Department of Electrical and Computer Engineering at Queen’s University and holds a Tier 2 Canada Research Chair in Future Communication Networks. He received his BEng (2007) and MEng (2010) degrees from Tongji University, Shanghai, China, and his PhD (2015) from the University of Waterloo, all in Electrical Engineering. Before joining Queen’s, Dr. Lu was an Assistant Professor in the Department of Computing Science at Thompson Rivers University. He was also a Postdoctoral Fellow at the Coordinated Science Laboratory, University of Illinois at Urbana-Champaign (2015–2016), and held a research internship at the National Institute of Informatics, Tokyo, in 2009. \n His research focuses on the design, optimization, and deployment of next-generation wireless networks, edge computing systems, and distributed machine learning algorithms. He has published extensively in top-tier venues such as IEEE/ACM Transactions on Networking, IEEE Journal on Selected Areas in Communications, ACM MobiHoc, and IEEE INFOCOM. He currently serves as an Editor for the IEEE Transactions on Wireless Communications and chairs the Special Interest Group on AI-Empowered Internet of Vehicles (IoV) under the IEEE Cognitive Networks Technical Committee. He is also a regular TPC member for major conferences such as IEEE INFOCOM, ACM MobiHoc, IEEE GLOBECOM, and IEEE ICC." 
    }
]